[Killed] StringLiteral
src/tools/find-pending-request.ts:35:49
   const filename = `${requestId}.json`;
   const pendingPath = `requests/pending/${filename}`;
 
-  const pendingFiles = await file.listDirectory("requests/pending");
+  const pendingFiles = await file.listDirectory("");
   if (!pendingFiles.includes(filename)) {
     const completedFiles = await file.listDirectory("requests/completed");
killedBy: garp_amend: amend a pending request sender amends a pending request, appending an amendment entry
statusReason: [When] Alice amends the request with updated fields -- Request req-20260221-143022-alice-a1b2 not found

[Killed] ConditionalExpression
src/tools/find-pending-request.ts:36:7
   const pendingPath = `requests/pending/${filename}`;
 
   const pendingFiles = await file.listDirectory("requests/pending");
-  if (!pendingFiles.includes(filename)) {
+  if (false) {
     const completedFiles = await file.listDirectory("requests/completed");
     if (completedFiles.includes(filename)) {
killedBy: garp_amend: amend a pending request rejects amendment when request is already completed
statusReason: [When] Alice tries to amend the completed request -- expected [Function] to throw error matching /already completed/i but got 'ENOENT: no such file or directory, op…'

[Killed] BooleanLiteral
src/tools/find-pending-request.ts:36:7
   const pendingPath = `requests/pending/${filename}`;
 
   const pendingFiles = await file.listDirectory("requests/pending");
-  if (!pendingFiles.includes(filename)) {
+  if (pendingFiles.includes(filename)) {
     const completedFiles = await file.listDirectory("requests/completed");
     if (completedFiles.includes(filename)) {
killedBy: garp_amend: amend a pending request sender amends a pending request, appending an amendment entry
statusReason: [When] Alice amends the request with updated fields -- Request req-20260221-143022-alice-a1b2 not found

[Killed] ConditionalExpression
src/tools/find-pending-request.ts:38:9
   const pendingFiles = await file.listDirectory("requests/pending");
   if (!pendingFiles.includes(filename)) {
     const completedFiles = await file.listDirectory("requests/completed");
-    if (completedFiles.includes(filename)) {
+    if (false) {
       throw new Error(`Request ${requestId} is already completed and cannot be ${action}`);
     }
killedBy: garp_amend: amend a pending request rejects amendment when request is already completed
statusReason: [When] Alice tries to amend the completed request -- expected [Function] to throw error matching /already completed/i but got 'Request req-20260221-143022-alice-a1b…'

[Killed] ConditionalExpression
src/tools/find-pending-request.ts:38:9
   const pendingFiles = await file.listDirectory("requests/pending");
   if (!pendingFiles.includes(filename)) {
     const completedFiles = await file.listDirectory("requests/completed");
-    if (completedFiles.includes(filename)) {
+    if (true) {
       throw new Error(`Request ${requestId} is already completed and cannot be ${action}`);
     }
killedBy: garp_amend: amend a pending request rejects amendment when request is already cancelled
statusReason: [When] Alice tries to amend the cancelled request -- expected [Function] to throw error matching /already cancelled/i but got 'Request req-20260221-143022-alice-a1b…'

[Killed] StringLiteral
src/tools/find-pending-request.ts:42:53
       throw new Error(`Request ${requestId} is already completed and cannot be ${action}`);
     }
 
-    const cancelledFiles = await file.listDirectory("requests/cancelled");
+    const cancelledFiles = await file.listDirectory("");
     if (cancelledFiles.includes(filename)) {
       throw new Error(`Request ${requestId} is already cancelled and cannot be ${action}`);
killedBy: garp_amend: amend a pending request rejects amendment when request is already cancelled
statusReason: [When] Alice tries to amend the cancelled request -- expected [Function] to throw error matching /already cancelled/i but got 'Request req-20260221-143022-alice-a1b…'

[Killed] BlockStatement
src/tools/find-pending-request.ts:43:44
     }
 
     const cancelledFiles = await file.listDirectory("requests/cancelled");
-    if (cancelledFiles.includes(filename)) {
-      throw new Error(`Request ${requestId} is already cancelled and cannot be ${action}`);
-    }
+    if (cancelledFiles.includes(filename)) {}
 
     throw new Error(`Request ${requestId} not found`);
killedBy: garp_amend: amend a pending request rejects amendment when request is already cancelled
statusReason: [When] Alice tries to amend the cancelled request -- expected [Function] to throw error matching /already cancelled/i but got 'Request req-20260221-143022-alice-a1b…'

[Killed] ConditionalExpression
src/tools/find-pending-request.ts:43:9
     }
 
     const cancelledFiles = await file.listDirectory("requests/cancelled");
-    if (cancelledFiles.includes(filename)) {
+    if (false) {
       throw new Error(`Request ${requestId} is already cancelled and cannot be ${action}`);
     }
killedBy: garp_amend: amend a pending request rejects amendment when request is already cancelled
statusReason: [When] Alice tries to amend the cancelled request -- expected [Function] to throw error matching /already cancelled/i but got 'Request req-20260221-143022-alice-a1b…'

[Killed] ConditionalExpression
src/tools/find-pending-request.ts:52:7
 
   const raw = await file.readJSON<unknown>(pendingPath);
   const parsed = RequestEnvelopeSchema.safeParse(raw);
-  if (!parsed.success) {
+  if (true) {
     throw new Error(
       `Malformed request envelope for ${requestId}: ${parsed.error.issues.map((i) => i.message).join(", ")}`,
killedBy: garp_amend: amend a pending request sender amends a pending request, appending an amendment entry
statusReason: [When] Alice amends the request with updated fields -- Cannot read properties of undefined (reading 'issues')

[Killed] BooleanLiteral
src/tools/find-pending-request.ts:52:7
 
   const raw = await file.readJSON<unknown>(pendingPath);
   const parsed = RequestEnvelopeSchema.safeParse(raw);
-  if (!parsed.success) {
+  if (parsed.success) {
     throw new Error(
       `Malformed request envelope for ${requestId}: ${parsed.error.issues.map((i) => i.message).join(", ")}`,
killedBy: garp_amend: amend a pending request sender amends a pending request, appending an amendment entry
statusReason: [When] Alice amends the request with updated fields -- Cannot read properties of undefined (reading 'issues')

[NoCoverage] ArrowFunction
src/tools/find-pending-request.ts:54:79
   const parsed = RequestEnvelopeSchema.safeParse(raw);
   if (!parsed.success) {
     throw new Error(
-      `Malformed request envelope for ${requestId}: ${parsed.error.issues.map((i) => i.message).join(", ")}`,
+      `Malformed request envelope for ${requestId}: ${parsed.error.issues.map(() => undefined).join(", ")}`,
     );
   }

[NoCoverage] StringLiteral
src/tools/find-pending-request.ts:54:102
   const parsed = RequestEnvelopeSchema.safeParse(raw);
   if (!parsed.success) {
     throw new Error(
-      `Malformed request envelope for ${requestId}: ${parsed.error.issues.map((i) => i.message).join(", ")}`,
+      `Malformed request envelope for ${requestId}: ${parsed.error.issues.map((i) => i.message).join("")}`,
     );
   }
