[Killed] BooleanLiteral
src/tools/garp-amend.ts:31:7
   ctx: GarpAmendContext,
 ): Promise<{ status: string; request_id: string; amendment_count: number; message: string }> {
   // 1. Validate required fields
-  if (!params.request_id) throw new Error("Missing required field: request_id");
+  if (params.request_id) throw new Error("Missing required field: request_id");
   if (!params.fields) throw new Error("Missing required field: fields");
 
killedBy: garp_amend: amend a pending request sender amends a pending request, appending an amendment entry
statusReason: [When] Alice amends the request with updated fields -- Missing required field: request_id

[Killed] ConditionalExpression
src/tools/garp-amend.ts:31:7
   ctx: GarpAmendContext,
 ): Promise<{ status: string; request_id: string; amendment_count: number; message: string }> {
   // 1. Validate required fields
-  if (!params.request_id) throw new Error("Missing required field: request_id");
+  if (true) throw new Error("Missing required field: request_id");
   if (!params.fields) throw new Error("Missing required field: fields");
 
killedBy: garp_amend: amend a pending request sender amends a pending request, appending an amendment entry
statusReason: [When] Alice amends the request with updated fields -- Missing required field: request_id

[Killed] BooleanLiteral
src/tools/garp-amend.ts:32:7
 ): Promise<{ status: string; request_id: string; amendment_count: number; message: string }> {
   // 1. Validate required fields
   if (!params.request_id) throw new Error("Missing required field: request_id");
-  if (!params.fields) throw new Error("Missing required field: fields");
+  if (params.fields) throw new Error("Missing required field: fields");
 
   // 2. Pull latest
killedBy: garp_amend: amend a pending request sender amends a pending request, appending an amendment entry
statusReason: [When] Alice amends the request with updated fields -- Missing required field: fields

[Killed] ConditionalExpression
src/tools/garp-amend.ts:32:7
 ): Promise<{ status: string; request_id: string; amendment_count: number; message: string }> {
   // 1. Validate required fields
   if (!params.request_id) throw new Error("Missing required field: request_id");
-  if (!params.fields) throw new Error("Missing required field: fields");
+  if (true) throw new Error("Missing required field: fields");
 
   // 2. Pull latest
killedBy: garp_amend: amend a pending request sender amends a pending request, appending an amendment entry
statusReason: [When] Alice amends the request with updated fields -- Missing required field: fields

[Killed] BlockStatement
src/tools/garp-amend.ts:43:47
   );
 
   // 4. Verify caller is the sender
-  if (envelope.sender.user_id !== ctx.userId) {
-    throw new Error("Only the sender can amend a request");
-  }
+  if (envelope.sender.user_id !== ctx.userId) {}
 
   // 5. Create amendment entry
killedBy: garp_amend: amend a pending request rejects amendment when caller is not the sender
statusReason: [When] Bob (the recipient, not sender) tries to amend -- promise resolved "{ status: 'amended', …(3) }" instead of rejecting

[Killed] EqualityOperator
src/tools/garp-amend.ts:43:7
   );
 
   // 4. Verify caller is the sender
-  if (envelope.sender.user_id !== ctx.userId) {
+  if (envelope.sender.user_id === ctx.userId) {
     throw new Error("Only the sender can amend a request");
   }
killedBy: garp_amend: amend a pending request sender amends a pending request, appending an amendment entry
statusReason: [When] Alice amends the request with updated fields -- Only the sender can amend a request

[Killed] ObjectLiteral
src/tools/garp-amend.ts:48:37
   }
 
   // 5. Create amendment entry
-  const amendment: AmendmentEntry = {
-    amended_at: new Date().toISOString(),
-    amended_by: ctx.userId,
-    fields: params.fields,
-    ...(params.note ? { note: params.note } : {}),
-  };
+  const amendment: AmendmentEntry = {};
 
   // 6. Build updated envelope with amendment appended
killedBy: garp_amend: amend a pending request sender amends a pending request, appending an amendment entry
statusReason: [Then] envelope in pending/ has the amendment entry appended -- expected {} to match object { amended_by: 'alice', …(2) }

[Killed] LogicalOperator
src/tools/garp-amend.ts:56:30
   };
 
   // 6. Build updated envelope with amendment appended
-  const existingAmendments = envelope.amendments ?? [];
+  const existingAmendments = envelope.amendments && [];
   const updatedEnvelope = {
     ...envelope,
killedBy: garp_amend: amend a pending request sender amends a pending request, appending an amendment entry
statusReason: [When] Alice amends the request with updated fields -- existingAmendments is not iterable
