[Survived] StringLiteral
src/tools/garp-cancel.ts:37:34
 
   // 3. Find and validate the pending request
   const { envelope, pendingPath } = await findPendingRequest(
-    params.request_id, ctx.file, "cancelled",
+    params.request_id, ctx.file, "",
   );
 

[Killed] BlockStatement
src/tools/garp-cancel.ts:41:47
   );
 
   // 4. Verify sender: only the original sender can cancel
-  if (envelope.sender.user_id !== ctx.userId) {
-    throw new Error("Only the sender can cancel a request");
-  }
+  if (envelope.sender.user_id !== ctx.userId) {}
 
   // 5. Update envelope: set status and optional cancel_reason
killedBy: garp_cancel: cancel a pending request rejects cancellation when the caller is not the sender
statusReason: [When] Bob (the recipient, not the sender) tries to cancel -- promise resolved "{ status: 'cancelled', …(2) }" instead of rejecting

[Killed] ConditionalExpression
src/tools/garp-cancel.ts:41:7
   );
 
   // 4. Verify sender: only the original sender can cancel
-  if (envelope.sender.user_id !== ctx.userId) {
+  if (false) {
     throw new Error("Only the sender can cancel a request");
   }
killedBy: garp_cancel: cancel a pending request rejects cancellation when the caller is not the sender
statusReason: [When] Bob (the recipient, not the sender) tries to cancel -- promise resolved "{ status: 'cancelled', …(2) }" instead of rejecting

[Killed] StringLiteral
src/tools/garp-cancel.ts:42:21
 
   // 4. Verify sender: only the original sender can cancel
   if (envelope.sender.user_id !== ctx.userId) {
-    throw new Error("Only the sender can cancel a request");
+    throw new Error("");
   }
 
killedBy: garp_cancel: cancel a pending request rejects cancellation when the caller is not the sender
statusReason: [When] Bob (the recipient, not the sender) tries to cancel -- expected [Function] to throw error matching /only the sender can cancel/i but got ''

[Killed] ObjectLiteral
src/tools/garp-cancel.ts:46:84
   }
 
   // 5. Update envelope: set status and optional cancel_reason
-  const updated = { ...envelope, status: "cancelled" as const, ...(params.reason ? { cancel_reason: params.reason } : {}) };
+  const updated = { ...envelope, status: "cancelled" as const, ...(params.reason ? {} : {}) };
 
   // 6. Write updated envelope, git mv to cancelled/, commit, push
killedBy: garp_cancel: cancel a pending request persists cancel_reason in the envelope when reason is provided
statusReason: [Then] the cancelled envelope has cancel_reason field -- expected undefined to be 'Found the answer myself' // Object.is equality

[Survived] StringLiteral
src/tools/garp-cancel.ts:49:20
   const updated = { ...envelope, status: "cancelled" as const, ...(params.reason ? { cancel_reason: params.reason } : {}) };
 
   // 6. Write updated envelope, git mv to cancelled/, commit, push
-  const filename = `${params.request_id}.json`;
+  const filename = ``;
   const cancelledPath = `requests/cancelled/${filename}`;
   await ctx.file.writeJSON(pendingPath, updated);

[Killed] StringLiteral
src/tools/garp-cancel.ts:50:25
 
   // 6. Write updated envelope, git mv to cancelled/, commit, push
   const filename = `${params.request_id}.json`;
-  const cancelledPath = `requests/cancelled/${filename}`;
+  const cancelledPath = ``;
   await ctx.file.writeJSON(pendingPath, updated);
   await ctx.git.mv(pendingPath, cancelledPath);
killedBy: garp_cancel: cancel a pending request sender cancels a pending request, moving it to cancelled/ with status cancelled
statusReason: [When] Alice cancels the request -- fatal: empty string is not a valid pathspec. please use . instead if you meant to match all paths

[Survived] ArrayDeclaration
src/tools/garp-cancel.ts:53:21
   const cancelledPath = `requests/cancelled/${filename}`;
   await ctx.file.writeJSON(pendingPath, updated);
   await ctx.git.mv(pendingPath, cancelledPath);
-  await ctx.git.add([cancelledPath]);
+  await ctx.git.add([]);
   await ctx.git.commit(`[garp] cancelled: ${params.request_id}`);
   await ctx.git.push();

[Killed] StringLiteral
src/tools/garp-cancel.ts:57:20
   await ctx.git.commit(`[garp] cancelled: ${params.request_id}`);
   await ctx.git.push();
 
-  return { status: "cancelled", request_id: params.request_id, message: "Request cancelled" };
+  return { status: "", request_id: params.request_id, message: "Request cancelled" };
 }
 
killedBy: garp_cancel: cancel a pending request sender cancels a pending request, moving it to cancelled/ with status cancelled
statusReason: [When] Alice cancels the request -- expected '' to be 'cancelled' // Object.is equality
