[Killed] BlockStatement
src/tools/garp-inbox.ts:64:7
   let warning: string | undefined;
 
   // 1. Pull latest (catch failure, set warning)
-  try {
-    await ctx.git.pull();
-  } catch {
+  try {} catch {
     warning = "Using local data (remote unreachable). Results may be stale.";
   }
killedBy: garp_inbox: check inbox for pending requests returns one pending request addressed to the current user
statusReason: [When] Bob checks his inbox -- expected [] to have a length of 1 but got +0

[Killed] BlockStatement
src/tools/garp-inbox.ts:66:11
   // 1. Pull latest (catch failure, set warning)
   try {
     await ctx.git.pull();
-  } catch {
-    warning = "Using local data (remote unreachable). Results may be stale.";
-  }
+  } catch {}
 
   // 2. List pending directory
killedBy: garp_inbox: check inbox for pending requests falls back to local state with a warning when git pull fails
statusReason: [When] Bob checks his inbox (remote unreachable) -- .toMatch() expects to receive a string, but got undefined

[Killed] StringLiteral
src/tools/garp-inbox.ts:67:15
   try {
     await ctx.git.pull();
   } catch {
-    warning = "Using local data (remote unreachable). Results may be stale.";
+    warning = "";
   }
 
killedBy: garp_inbox: check inbox for pending requests falls back to local state with a warning when git pull fails
statusReason: [When] Bob checks his inbox (remote unreachable) -- .toMatch() expects to receive a string, but got undefined

[Killed] ArrayDeclaration
src/tools/garp-inbox.ts:74:33
   const files = await ctx.file.listDirectory("requests/pending");
 
   // 3. Parse each through schema, filter by recipient == userId
-  const entries: InboxEntry[] = [];
+  const entries: InboxEntry[] = ["Stryker was here"];
   for (const file of files) {
     const raw = await ctx.file.readJSON<unknown>(`requests/pending/${file}`);
killedBy: garp_inbox: check inbox for pending requests returns one pending request addressed to the current user
statusReason: [When] Bob checks his inbox -- expected [ 'Stryker was here', { …(9) } ] to have a length of 1 but got 2

[Killed] EqualityOperator
src/tools/garp-inbox.ts:83:9
       continue;
     }
     const envelope = parsed.data;
-    if (envelope.recipient.user_id === ctx.userId) {
+    if (envelope.recipient.user_id !== ctx.userId) {
       const bundle = envelope.context_bundle as Record<string, unknown>;
       const parts = envelope.request_id.split("-");
killedBy: garp_inbox: check inbox for pending requests returns one pending request addressed to the current user
statusReason: [When] Bob checks his inbox -- expected [] to have a length of 1 but got +0

[Killed] ConditionalExpression
src/tools/garp-inbox.ts:83:9
       continue;
     }
     const envelope = parsed.data;
-    if (envelope.recipient.user_id === ctx.userId) {
+    if (false) {
       const bundle = envelope.context_bundle as Record<string, unknown>;
       const parts = envelope.request_id.split("-");
killedBy: garp_inbox: check inbox for pending requests returns one pending request addressed to the current user
statusReason: [When] Bob checks his inbox -- expected [] to have a length of 1 but got +0

[Killed] MethodExpression
src/tools/garp-inbox.ts:86:23
     if (envelope.recipient.user_id === ctx.userId) {
       const bundle = envelope.context_bundle as Record<string, unknown>;
       const parts = envelope.request_id.split("-");
-      const shortId = parts.slice(-2).join("-");
+      const shortId = parts.join("-");
       entries.push({
         request_id: envelope.request_id,
killedBy: garp_inbox: check inbox for pending requests includes short_id derived from request_id in inbox entries
statusReason: [When] Bob checks his inbox -- expected 'req-20260221-140000-alice-a1b2' to be 'alice-a1b2' // Object.is equality

[Killed] UnaryOperator
src/tools/garp-inbox.ts:86:35
     if (envelope.recipient.user_id === ctx.userId) {
       const bundle = envelope.context_bundle as Record<string, unknown>;
       const parts = envelope.request_id.split("-");
-      const shortId = parts.slice(-2).join("-");
+      const shortId = parts.slice(+2).join("-");
       entries.push({
         request_id: envelope.request_id,
killedBy: garp_inbox: check inbox for pending requests includes short_id derived from request_id in inbox entries
statusReason: [When] Bob checks his inbox -- expected '140000-alice-a1b2' to be 'alice-a1b2' // Object.is equality

[Killed] ObjectLiteral
src/tools/garp-inbox.ts:87:20
       const bundle = envelope.context_bundle as Record<string, unknown>;
       const parts = envelope.request_id.split("-");
       const shortId = parts.slice(-2).join("-");
-      entries.push({
-        request_id: envelope.request_id,
-        short_id: shortId,
-        ...(envelope.thread_id ? { thread_id: envelope.thread_id } : {}),
-        request_type: envelope.request_type,
-        sender: envelope.sender.display_name,
-        created_at: envelope.created_at,
-        summary:
-          (bundle.question as string) ??
-          (bundle.issue_summary as string) ??
-          "No summary",
-        skill_path: `${ctx.repoPath}/skills/${envelope.request_type}/SKILL.md`,
-        attachment_count: envelope.attachments?.length ?? 0,
-        amendment_count: envelope.amendments?.length ?? 0,
-        ...(envelope.attachments && envelope.attachments.length > 0
-          ? { attachments: envelope.attachments.map(a => ({ filename: a.filename, description: a.description })) }
-          : {}),
-      });
+      entries.push({});
     }
   }
killedBy: garp_inbox: check inbox for pending requests returns one pending request addressed to the current user
statusReason: [When] Bob checks his inbox -- expected {} to match object { …(3) }

[Killed] LogicalOperator
src/tools/garp-inbox.ts:95:11
         sender: envelope.sender.display_name,
         created_at: envelope.created_at,
         summary:
-          (bundle.question as string) ??
-          (bundle.issue_summary as string) ??
+          bundle.question as string && bundle.issue_summary as string ??
           "No summary",
         skill_path: `${ctx.repoPath}/skills/${envelope.request_type}/SKILL.md`,
killedBy: garp_inbox: check inbox for pending requests includes a summary from the context bundle for triage
statusReason: [When] Bob checks his inbox -- expected 'No summary' to contain 'memory leak'

[Killed] LogicalOperator
src/tools/garp-inbox.ts:95:11
         sender: envelope.sender.display_name,
         created_at: envelope.created_at,
         summary:
-          (bundle.question as string) ??
-          (bundle.issue_summary as string) ??
-          "No summary",
+          (bundle.question as string ?? bundle.issue_summary as string) && "No summary",
         skill_path: `${ctx.repoPath}/skills/${envelope.request_type}/SKILL.md`,
         attachment_count: envelope.attachments?.length ?? 0,
killedBy: garp_inbox: check inbox for pending requests includes a summary from the context bundle for triage
statusReason: [When] Bob checks his inbox -- expected 'No summary' to contain 'memory leak'

[Killed] LogicalOperator
src/tools/garp-inbox.ts:99:27
           (bundle.issue_summary as string) ??
           "No summary",
         skill_path: `${ctx.repoPath}/skills/${envelope.request_type}/SKILL.md`,
-        attachment_count: envelope.attachments?.length ?? 0,
+        attachment_count: envelope.attachments?.length && 0,
         amendment_count: envelope.amendments?.length ?? 0,
         ...(envelope.attachments && envelope.attachments.length > 0
killedBy: garp_inbox: check inbox for pending requests includes attachment_count in inbox entries
statusReason: [When] Bob checks his inbox -- expected +0 to be 2 // Object.is equality

[Killed] OptionalChaining
src/tools/garp-inbox.ts:99:27
           (bundle.issue_summary as string) ??
           "No summary",
         skill_path: `${ctx.repoPath}/skills/${envelope.request_type}/SKILL.md`,
-        attachment_count: envelope.attachments?.length ?? 0,
+        attachment_count: envelope.attachments.length ?? 0,
         amendment_count: envelope.amendments?.length ?? 0,
         ...(envelope.attachments && envelope.attachments.length > 0
killedBy: garp_inbox: check inbox for pending requests returns one pending request addressed to the current user
statusReason: [When] Bob checks his inbox -- Cannot read properties of undefined (reading 'length')

[Killed] LogicalOperator
src/tools/garp-inbox.ts:100:26
           "No summary",
         skill_path: `${ctx.repoPath}/skills/${envelope.request_type}/SKILL.md`,
         attachment_count: envelope.attachments?.length ?? 0,
-        amendment_count: envelope.amendments?.length ?? 0,
+        amendment_count: envelope.amendments?.length && 0,
         ...(envelope.attachments && envelope.attachments.length > 0
           ? { attachments: envelope.attachments.map(a => ({ filename: a.filename, description: a.description })) }
killedBy: garp_inbox: check inbox for pending requests includes amendment_count in inbox entries
statusReason: [When] Bob checks his inbox -- expected +0 to be 2 // Object.is equality

[Killed] OptionalChaining
src/tools/garp-inbox.ts:100:26
           "No summary",
         skill_path: `${ctx.repoPath}/skills/${envelope.request_type}/SKILL.md`,
         attachment_count: envelope.attachments?.length ?? 0,
-        amendment_count: envelope.amendments?.length ?? 0,
+        amendment_count: envelope.amendments.length ?? 0,
         ...(envelope.attachments && envelope.attachments.length > 0
           ? { attachments: envelope.attachments.map(a => ({ filename: a.filename, description: a.description })) }
killedBy: garp_inbox: check inbox for pending requests returns one pending request addressed to the current user
statusReason: [When] Bob checks his inbox -- Cannot read properties of undefined (reading 'length')

[Killed] LogicalOperator
src/tools/garp-inbox.ts:101:13
         skill_path: `${ctx.repoPath}/skills/${envelope.request_type}/SKILL.md`,
         attachment_count: envelope.attachments?.length ?? 0,
         amendment_count: envelope.amendments?.length ?? 0,
-        ...(envelope.attachments && envelope.attachments.length > 0
+        ...(envelope.attachments || envelope.attachments.length > 0
           ? { attachments: envelope.attachments.map(a => ({ filename: a.filename, description: a.description })) }
           : {}),
killedBy: garp_inbox: check inbox for pending requests returns one pending request addressed to the current user
statusReason: [When] Bob checks his inbox -- Cannot read properties of undefined (reading 'length')

[Killed] EqualityOperator
src/tools/garp-inbox.ts:101:37
         skill_path: `${ctx.repoPath}/skills/${envelope.request_type}/SKILL.md`,
         attachment_count: envelope.attachments?.length ?? 0,
         amendment_count: envelope.amendments?.length ?? 0,
-        ...(envelope.attachments && envelope.attachments.length > 0
+        ...(envelope.attachments && envelope.attachments.length <= 0
           ? { attachments: envelope.attachments.map(a => ({ filename: a.filename, description: a.description })) }
           : {}),
killedBy: garp_inbox: check inbox for pending requests includes attachment metadata in inbox entries
statusReason: [When] Bob checks his inbox -- expected undefined to deeply equal [ …(2) ]

[Killed] ArrowFunction
src/tools/garp-inbox.ts:102:53
         attachment_count: envelope.attachments?.length ?? 0,
         amendment_count: envelope.amendments?.length ?? 0,
         ...(envelope.attachments && envelope.attachments.length > 0
-          ? { attachments: envelope.attachments.map(a => ({ filename: a.filename, description: a.description })) }
+          ? { attachments: envelope.attachments.map(() => undefined) }
           : {}),
       });
killedBy: garp_inbox: check inbox for pending requests includes attachment metadata in inbox entries
statusReason: [When] Bob checks his inbox -- expected [ undefined, undefined ] to deeply equal [ …(2) ]

[Killed] ObjectLiteral
src/tools/garp-inbox.ts:102:59
         attachment_count: envelope.attachments?.length ?? 0,
         amendment_count: envelope.amendments?.length ?? 0,
         ...(envelope.attachments && envelope.attachments.length > 0
-          ? { attachments: envelope.attachments.map(a => ({ filename: a.filename, description: a.description })) }
+          ? { attachments: envelope.attachments.map(a => ({})) }
           : {}),
       });
killedBy: garp_inbox: check inbox for pending requests includes attachment metadata in inbox entries
statusReason: [When] Bob checks his inbox -- expected [ {}, {} ] to deeply equal [ …(2) ]

[Killed] BlockStatement
src/tools/garp-inbox.ts:110:32
 
   // 4. Group by thread_id
   const threadGroups = new Map<string, InboxEntry[]>();
-  for (const entry of entries) {
-    // Use thread_id as key, or request_id for entries without thread_id (always standalone)
-    const key = entry.thread_id ?? entry.request_id;
-    const group = threadGroups.get(key);
-    if (group) {
-      group.push(entry);
-    } else {
-      threadGroups.set(key, [entry]);
-    }
-  }
+  for (const entry of entries) {}
 
   // 5. Emit standalone or grouped items
killedBy: garp_inbox: check inbox for pending requests returns one pending request addressed to the current user
statusReason: [When] Bob checks his inbox -- expected [] to have a length of 1 but got +0

[Killed] LogicalOperator
src/tools/garp-inbox.ts:112:17
   const threadGroups = new Map<string, InboxEntry[]>();
   for (const entry of entries) {
     // Use thread_id as key, or request_id for entries without thread_id (always standalone)
-    const key = entry.thread_id ?? entry.request_id;
+    const key = entry.thread_id && entry.request_id;
     const group = threadGroups.get(key);
     if (group) {
killedBy: garp_inbox: check inbox for pending requests only shows requests addressed to the current user, not others
statusReason: [When] Bob checks his inbox -- expected [ { is_thread_group: true, …(12) } ] to have a length of 2 but got 1

[Killed] BlockStatement
src/tools/garp-inbox.ts:114:16
     // Use thread_id as key, or request_id for entries without thread_id (always standalone)
     const key = entry.thread_id ?? entry.request_id;
     const group = threadGroups.get(key);
-    if (group) {
-      group.push(entry);
-    } else {
+    if (group) {} else {
       threadGroups.set(key, [entry]);
     }
killedBy: garp_inbox: check inbox for pending requests groups pending requests by thread_id when 2+ share the same thread
statusReason: [When] Bob checks his inbox -- [Then] the thread group has correct aggregated fields -- expected undefined to be defined

[Killed] ConditionalExpression
src/tools/garp-inbox.ts:114:9
     // Use thread_id as key, or request_id for entries without thread_id (always standalone)
     const key = entry.thread_id ?? entry.request_id;
     const group = threadGroups.get(key);
-    if (group) {
+    if (true) {
       group.push(entry);
     } else {
killedBy: garp_inbox: check inbox for pending requests returns one pending request addressed to the current user
statusReason: [When] Bob checks his inbox -- Cannot read properties of undefined (reading 'push')

[Killed] BlockStatement
src/tools/garp-inbox.ts:116:12
     const group = threadGroups.get(key);
     if (group) {
       group.push(entry);
-    } else {
-      threadGroups.set(key, [entry]);
-    }
+    } else {}
   }
 
killedBy: garp_inbox: check inbox for pending requests returns one pending request addressed to the current user
statusReason: [When] Bob checks his inbox -- expected [] to have a length of 1 but got +0

[Killed] BlockStatement
src/tools/garp-inbox.ts:124:29
   // 5. Emit standalone or grouped items
   const requests: Array<InboxEntry | InboxThreadGroup> = [];
   for (const [key, group] of threadGroups) {
-    if (group.length === 1) {
-      // Standalone: single pending entry in this thread (or no thread_id)
-      requests.push(group[0]);
-    } else {
+    if (group.length === 1) {} else {
       // Thread group: 2+ pending entries share a thread_id
       // Sort group by created_at ascending to find latest
killedBy: garp_inbox: check inbox for pending requests returns one pending request addressed to the current user
statusReason: [When] Bob checks his inbox -- expected [] to have a length of 1 but got +0

[Killed] ConditionalExpression
src/tools/garp-inbox.ts:124:9
   // 5. Emit standalone or grouped items
   const requests: Array<InboxEntry | InboxThreadGroup> = [];
   for (const [key, group] of threadGroups) {
-    if (group.length === 1) {
+    if (false) {
       // Standalone: single pending entry in this thread (or no thread_id)
       requests.push(group[0]);
killedBy: garp_inbox: check inbox for pending requests returns one pending request addressed to the current user
statusReason: [When] Bob checks his inbox -- expected { is_thread_group: true, …(12) } to match object { …(3) }
(11 matching properties omitted from actual)

[Killed] BlockStatement
src/tools/garp-inbox.ts:127:12
     if (group.length === 1) {
       // Standalone: single pending entry in this thread (or no thread_id)
       requests.push(group[0]);
-    } else {
-      // Thread group: 2+ pending entries share a thread_id
-      // Sort group by created_at ascending to find latest
-      group.sort(
-        (a, b) => new Date(a.created_at).getTime() - new Date(b.created_at).getTime(),
-      );
-      const latest = group[group.length - 1];
-      requests.push({
-        is_thread_group: true,
-        thread_id: key,
-        request_type: latest.request_type,
-        sender: latest.sender,
-        round_count: group.length,
-        latest_request_id: latest.request_id,
-        latest_short_id: latest.short_id,
-        latest_summary: latest.summary,
-        created_at: latest.created_at,
-        request_ids: group.map((e) => e.request_id),
-        skill_path: latest.skill_path,
-        attachment_count: group.reduce((sum, e) => sum + e.attachment_count, 0),
-        amendment_count: group.reduce((sum, e) => sum + e.amendment_count, 0),
-      });
-    }
+    } else {}
   }
 
killedBy: garp_inbox: check inbox for pending requests groups pending requests by thread_id when 2+ share the same thread
statusReason: [When] Bob checks his inbox -- [Then] the result contains 2 items (1 group + 1 standalone) -- expected [ { …(10) } ] to have a length of 2 but got 1

[Survived] MethodExpression
src/tools/garp-inbox.ts:130:7
     } else {
       // Thread group: 2+ pending entries share a thread_id
       // Sort group by created_at ascending to find latest
-      group.sort(
-        (a, b) => new Date(a.created_at).getTime() - new Date(b.created_at).getTime(),
-      );
+      group;
       const latest = group[group.length - 1];
       requests.push({

[Survived] ArithmeticOperator
src/tools/garp-inbox.ts:131:19
       // Thread group: 2+ pending entries share a thread_id
       // Sort group by created_at ascending to find latest
       group.sort(
-        (a, b) => new Date(a.created_at).getTime() - new Date(b.created_at).getTime(),
+        (a, b) => new Date(a.created_at).getTime() + new Date(b.created_at).getTime(),
       );
       const latest = group[group.length - 1];

[Survived] ArrowFunction
src/tools/garp-inbox.ts:131:9
       // Thread group: 2+ pending entries share a thread_id
       // Sort group by created_at ascending to find latest
       group.sort(
-        (a, b) => new Date(a.created_at).getTime() - new Date(b.created_at).getTime(),
+        () => undefined,
       );
       const latest = group[group.length - 1];

[Killed] ArithmeticOperator
src/tools/garp-inbox.ts:133:28
       group.sort(
         (a, b) => new Date(a.created_at).getTime() - new Date(b.created_at).getTime(),
       );
-      const latest = group[group.length - 1];
+      const latest = group[group.length + 1];
       requests.push({
         is_thread_group: true,
killedBy: garp_inbox: check inbox for pending requests groups pending requests by thread_id when 2+ share the same thread
statusReason: [When] Bob checks his inbox -- Cannot read properties of undefined (reading 'request_type')

[Killed] BooleanLiteral
src/tools/garp-inbox.ts:135:26
       );
       const latest = group[group.length - 1];
       requests.push({
-        is_thread_group: true,
+        is_thread_group: false,
         thread_id: key,
         request_type: latest.request_type,
killedBy: garp_inbox: check inbox for pending requests groups pending requests by thread_id when 2+ share the same thread
statusReason: [When] Bob checks his inbox -- [Then] the thread group has correct aggregated fields -- expected undefined to be defined

[Killed] ArrowFunction
src/tools/garp-inbox.ts:144:32
         latest_short_id: latest.short_id,
         latest_summary: latest.summary,
         created_at: latest.created_at,
-        request_ids: group.map((e) => e.request_id),
+        request_ids: group.map(() => undefined),
         skill_path: latest.skill_path,
         attachment_count: group.reduce((sum, e) => sum + e.attachment_count, 0),
killedBy: garp_inbox: check inbox for pending requests groups pending requests by thread_id when 2+ share the same thread
statusReason: [When] Bob checks his inbox -- [Then] the thread group has correct aggregated fields -- expected [ undefined, undefined ] to include 'req-20260222-100000-alice-0001'

[Survived] ArithmeticOperator
src/tools/garp-inbox.ts:146:52
         created_at: latest.created_at,
         request_ids: group.map((e) => e.request_id),
         skill_path: latest.skill_path,
-        attachment_count: group.reduce((sum, e) => sum + e.attachment_count, 0),
+        attachment_count: group.reduce((sum, e) => sum - e.attachment_count, 0),
         amendment_count: group.reduce((sum, e) => sum + e.amendment_count, 0),
       });

[Survived] ArrowFunction
src/tools/garp-inbox.ts:146:40
         created_at: latest.created_at,
         request_ids: group.map((e) => e.request_id),
         skill_path: latest.skill_path,
-        attachment_count: group.reduce((sum, e) => sum + e.attachment_count, 0),
+        attachment_count: group.reduce(() => undefined, 0),
         amendment_count: group.reduce((sum, e) => sum + e.amendment_count, 0),
       });

[Survived] ArithmeticOperator
src/tools/garp-inbox.ts:147:51
         request_ids: group.map((e) => e.request_id),
         skill_path: latest.skill_path,
         attachment_count: group.reduce((sum, e) => sum + e.attachment_count, 0),
-        amendment_count: group.reduce((sum, e) => sum + e.amendment_count, 0),
+        amendment_count: group.reduce((sum, e) => sum - e.amendment_count, 0),
       });
     }

[Survived] ArrowFunction
src/tools/garp-inbox.ts:147:39
         request_ids: group.map((e) => e.request_id),
         skill_path: latest.skill_path,
         attachment_count: group.reduce((sum, e) => sum + e.attachment_count, 0),
-        amendment_count: group.reduce((sum, e) => sum + e.amendment_count, 0),
+        amendment_count: group.reduce(() => undefined, 0),
       });
     }

[Survived] MethodExpression
src/tools/garp-inbox.ts:153:3
   }
 
   // 6. Sort all items by created_at ascending (oldest first)
-  requests.sort(
-    (a, b) => {
-      const aTime = new Date(a.created_at).getTime();
-      const bTime = new Date(b.created_at).getTime();
-      return aTime - bTime;
-    },
-  );
+  requests;
 
   return { requests, ...(warning ? { warning } : {}) };

[Survived] BlockStatement
src/tools/garp-inbox.ts:154:15
 
   // 6. Sort all items by created_at ascending (oldest first)
   requests.sort(
-    (a, b) => {
-      const aTime = new Date(a.created_at).getTime();
-      const bTime = new Date(b.created_at).getTime();
-      return aTime - bTime;
-    },
+    (a, b) => {},
   );
 

[Survived] ArithmeticOperator
src/tools/garp-inbox.ts:157:14
     (a, b) => {
       const aTime = new Date(a.created_at).getTime();
       const bTime = new Date(b.created_at).getTime();
-      return aTime - bTime;
+      return aTime + bTime;
     },
   );
