[Killed] BlockStatement
src/tools/garp-status.ts:35:73
   warning?: string;
 }
 
-function parseRequestEnvelope(raw: unknown, requestId: string): unknown {
-  const parsed = RequestEnvelopeSchema.safeParse(raw);
-  if (!parsed.success) {
-    log("warn", "malformed request envelope", { request_id: requestId, errors: parsed.error.issues });
-    return raw; // Return raw data so the user still sees something
-  }
-  return parsed.data;
-}
+function parseRequestEnvelope(raw: unknown, requestId: string): unknown {}
 
 function parseResponseEnvelope(raw: unknown, requestId: string): unknown {
killedBy: garp_status: check request status and response includes the original request data in the status response
statusReason: [When] Alice checks status -- expected undefined to match object { …(4) }

[NoCoverage] StringLiteral
src/tools/garp-status.ts:38:17
 function parseRequestEnvelope(raw: unknown, requestId: string): unknown {
   const parsed = RequestEnvelopeSchema.safeParse(raw);
   if (!parsed.success) {
-    log("warn", "malformed request envelope", { request_id: requestId, errors: parsed.error.issues });
+    log("warn", "", { request_id: requestId, errors: parsed.error.issues });
     return raw; // Return raw data so the user still sees something
   }

[NoCoverage] StringLiteral
src/tools/garp-status.ts:38:9
 function parseRequestEnvelope(raw: unknown, requestId: string): unknown {
   const parsed = RequestEnvelopeSchema.safeParse(raw);
   if (!parsed.success) {
-    log("warn", "malformed request envelope", { request_id: requestId, errors: parsed.error.issues });
+    log("", "malformed request envelope", { request_id: requestId, errors: parsed.error.issues });
     return raw; // Return raw data so the user still sees something
   }

[Killed] BlockStatement
src/tools/garp-status.ts:44:74
   return parsed.data;
 }
 
-function parseResponseEnvelope(raw: unknown, requestId: string): unknown {
-  const parsed = ResponseEnvelopeSchema.safeParse(raw);
-  if (!parsed.success) {
-    log("warn", "malformed response envelope", { request_id: requestId, errors: parsed.error.issues });
-    return raw;
-  }
-  return parsed.data;
-}
+function parseResponseEnvelope(raw: unknown, requestId: string): unknown {}
 
 /** Parse raw JSON into a typed envelope for attachment resolution. Falls back to a minimal stub. */
killedBy: garp_status: check request status and response returns completed status with full response for a finished request
statusReason: [When] Alice checks the status of her request -- expected undefined to be defined

[Killed] ConditionalExpression
src/tools/garp-status.ts:46:7
 
 function parseResponseEnvelope(raw: unknown, requestId: string): unknown {
   const parsed = ResponseEnvelopeSchema.safeParse(raw);
-  if (!parsed.success) {
+  if (true) {
     log("warn", "malformed response envelope", { request_id: requestId, errors: parsed.error.issues });
     return raw;
killedBy: garp_status: check request status and response returns completed status with full response for a finished request
statusReason: [When] Alice checks the status of her request -- Cannot read properties of undefined (reading 'issues')

[Killed] BooleanLiteral
src/tools/garp-status.ts:46:7
 
 function parseResponseEnvelope(raw: unknown, requestId: string): unknown {
   const parsed = ResponseEnvelopeSchema.safeParse(raw);
-  if (!parsed.success) {
+  if (parsed.success) {
     log("warn", "malformed response envelope", { request_id: requestId, errors: parsed.error.issues });
     return raw;
killedBy: garp_status: check request status and response returns completed status with full response for a finished request
statusReason: [When] Alice checks the status of her request -- Cannot read properties of undefined (reading 'issues')

[NoCoverage] ObjectLiteral
src/tools/garp-status.ts:47:48
 function parseResponseEnvelope(raw: unknown, requestId: string): unknown {
   const parsed = ResponseEnvelopeSchema.safeParse(raw);
   if (!parsed.success) {
-    log("warn", "malformed response envelope", { request_id: requestId, errors: parsed.error.issues });
+    log("warn", "malformed response envelope", {});
     return raw;
   }

[Killed] BlockStatement
src/tools/garp-status.ts:54:148
 }
 
 /** Parse raw JSON into a typed envelope for attachment resolution. Falls back to a minimal stub. */
-function tryParseEnvelope(raw: unknown, requestId: string): { attachments?: Array<{ filename: string; description: string }>; request_id: string } {
-  const parsed = RequestEnvelopeSchema.safeParse(raw);
-  if (parsed.success) return parsed.data;
-  return { request_id: requestId };
-}
+function tryParseEnvelope(raw: unknown, requestId: string): { attachments?: Array<{ filename: string; description: string }>; request_id: string } {}
 
 function resolveAttachmentPaths(
killedBy: garp_status: check request status and response returns completed status with full response for a finished request
statusReason: [When] Alice checks the status of her request -- Cannot read properties of undefined (reading 'attachments')

[Killed] ConditionalExpression
src/tools/garp-status.ts:56:7
 /** Parse raw JSON into a typed envelope for attachment resolution. Falls back to a minimal stub. */
 function tryParseEnvelope(raw: unknown, requestId: string): { attachments?: Array<{ filename: string; description: string }>; request_id: string } {
   const parsed = RequestEnvelopeSchema.safeParse(raw);
-  if (parsed.success) return parsed.data;
+  if (false) return parsed.data;
   return { request_id: requestId };
 }
killedBy: garp_status: check request status and response returns attachment_paths with absolute paths when request has attachments
statusReason: [When] Alice checks the status of her request -- expected undefined to be defined

[Survived] ConditionalExpression
src/tools/garp-status.ts:56:7
 /** Parse raw JSON into a typed envelope for attachment resolution. Falls back to a minimal stub. */
 function tryParseEnvelope(raw: unknown, requestId: string): { attachments?: Array<{ filename: string; description: string }>; request_id: string } {
   const parsed = RequestEnvelopeSchema.safeParse(raw);
-  if (parsed.success) return parsed.data;
+  if (true) return parsed.data;
   return { request_id: requestId };
 }

[NoCoverage] ObjectLiteral
src/tools/garp-status.ts:57:10
 function tryParseEnvelope(raw: unknown, requestId: string): { attachments?: Array<{ filename: string; description: string }>; request_id: string } {
   const parsed = RequestEnvelopeSchema.safeParse(raw);
   if (parsed.success) return parsed.data;
-  return { request_id: requestId };
+  return {};
 }
 

[Killed] BlockStatement
src/tools/garp-status.ts:63:79
 function resolveAttachmentPaths(
   envelope: { attachments?: Array<{ filename: string; description: string }>; request_id: string },
   repoPath: string,
-): Array<{ filename: string; description: string; path: string }> | undefined {
-  if (!envelope.attachments || envelope.attachments.length === 0) return undefined;
-  return envelope.attachments.map(a => ({
-    filename: a.filename,
-    description: a.description,
-    path: join(repoPath, "attachments", envelope.request_id, a.filename),
-  }));
-}
+): Array<{ filename: string; description: string; path: string }> | undefined {}
 
 export async function handleGarpStatus(
killedBy: garp_status: check request status and response returns attachment_paths with absolute paths when request has attachments
statusReason: [When] Alice checks the status of her request -- expected undefined to be defined

[Killed] ConditionalExpression
src/tools/garp-status.ts:64:7
   envelope: { attachments?: Array<{ filename: string; description: string }>; request_id: string },
   repoPath: string,
 ): Array<{ filename: string; description: string; path: string }> | undefined {
-  if (!envelope.attachments || envelope.attachments.length === 0) return undefined;
+  if (true) return undefined;
   return envelope.attachments.map(a => ({
     filename: a.filename,
killedBy: garp_status: check request status and response returns attachment_paths with absolute paths when request has attachments
statusReason: [When] Alice checks the status of her request -- expected undefined to be defined

[Killed] LogicalOperator
src/tools/garp-status.ts:64:7
   envelope: { attachments?: Array<{ filename: string; description: string }>; request_id: string },
   repoPath: string,
 ): Array<{ filename: string; description: string; path: string }> | undefined {
-  if (!envelope.attachments || envelope.attachments.length === 0) return undefined;
+  if (!envelope.attachments && envelope.attachments.length === 0) return undefined;
   return envelope.attachments.map(a => ({
     filename: a.filename,
killedBy: garp_status: check request status and response returns completed status with full response for a finished request
statusReason: [When] Alice checks the status of her request -- Cannot read properties of undefined (reading 'length')

[Killed] ArrowFunction
src/tools/garp-status.ts:65:35
   repoPath: string,
 ): Array<{ filename: string; description: string; path: string }> | undefined {
   if (!envelope.attachments || envelope.attachments.length === 0) return undefined;
-  return envelope.attachments.map(a => ({
-    filename: a.filename,
-    description: a.description,
-    path: join(repoPath, "attachments", envelope.request_id, a.filename),
-  }));
+  return envelope.attachments.map(() => undefined);
 }
 
killedBy: garp_status: check request status and response returns attachment_paths with absolute paths when request has attachments
statusReason: [When] Alice checks the status of her request -- expected undefined to deeply equal { filename: 'crash.log', …(2) }

[Killed] ConditionalExpression
src/tools/garp-status.ts:76:7
   params: GarpStatusParams,
   ctx: GarpStatusContext,
 ): Promise<GarpStatusResult> {
-  if (!params.request_id) throw new Error("Missing required field: request_id");
+  if (true) throw new Error("Missing required field: request_id");
 
   let warning: string | undefined;
killedBy: garp_status: check request status and response returns completed status with full response for a finished request
statusReason: [When] Alice checks the status of her request -- Missing required field: request_id

[Killed] BooleanLiteral
src/tools/garp-status.ts:76:7
   params: GarpStatusParams,
   ctx: GarpStatusContext,
 ): Promise<GarpStatusResult> {
-  if (!params.request_id) throw new Error("Missing required field: request_id");
+  if (params.request_id) throw new Error("Missing required field: request_id");
 
   let warning: string | undefined;
killedBy: garp_status: check request status and response returns completed status with full response for a finished request
statusReason: [When] Alice checks the status of her request -- Missing required field: request_id

[Killed] StringLiteral
src/tools/garp-status.ts:88:53
   }
 
   // 2. Search pending/
-  const pendingFiles = await ctx.file.listDirectory("requests/pending");
+  const pendingFiles = await ctx.file.listDirectory("");
   if (pendingFiles.includes(`${params.request_id}.json`)) {
     const raw = await ctx.file.readJSON<unknown>(`requests/pending/${params.request_id}.json`);
killedBy: garp_status: check request status and response returns pending status with no response for a waiting request
statusReason: [When] Alice checks the status of her request -- Request req-20260221-143022-alice-a1b2 not found in any directory

[Killed] BlockStatement
src/tools/garp-status.ts:89:59
 
   // 2. Search pending/
   const pendingFiles = await ctx.file.listDirectory("requests/pending");
-  if (pendingFiles.includes(`${params.request_id}.json`)) {
-    const raw = await ctx.file.readJSON<unknown>(`requests/pending/${params.request_id}.json`);
-    const request = parseRequestEnvelope(raw, params.request_id);
-    const attachment_paths = resolveAttachmentPaths(tryParseEnvelope(raw, params.request_id), ctx.repoPath);
-    return { status: "pending", request, response: undefined, ...(attachment_paths ? { attachment_paths } : {}), ...(warning ? { warning } : {}) };
-  }
+  if (pendingFiles.includes(`${params.request_id}.json`)) {}
 
   // 3. Search active/ (Tier 2: brain service acknowledges request)
killedBy: garp_status: check request status and response returns pending status with no response for a waiting request
statusReason: [When] Alice checks the status of her request -- Request req-20260221-143022-alice-a1b2 not found in any directory

[Killed] ConditionalExpression
src/tools/garp-status.ts:89:7
 
   // 2. Search pending/
   const pendingFiles = await ctx.file.listDirectory("requests/pending");
-  if (pendingFiles.includes(`${params.request_id}.json`)) {
+  if (true) {
     const raw = await ctx.file.readJSON<unknown>(`requests/pending/${params.request_id}.json`);
     const request = parseRequestEnvelope(raw, params.request_id);
killedBy: garp_status: check request status and response returns completed status with full response for a finished request
statusReason: [When] Alice checks the status of her request -- ENOENT: no such file or directory, open '/var/folders/3j/t9wfhf615y903ky6m76j7sx80000gn/T/garp-accept-PxBnCa/alice/requests/pending/req-20260221-143022-alice-a1b2.json'

[Killed] StringLiteral
src/tools/garp-status.ts:90:50
   // 2. Search pending/
   const pendingFiles = await ctx.file.listDirectory("requests/pending");
   if (pendingFiles.includes(`${params.request_id}.json`)) {
-    const raw = await ctx.file.readJSON<unknown>(`requests/pending/${params.request_id}.json`);
+    const raw = await ctx.file.readJSON<unknown>(``);
     const request = parseRequestEnvelope(raw, params.request_id);
     const attachment_paths = resolveAttachmentPaths(tryParseEnvelope(raw, params.request_id), ctx.repoPath);
killedBy: garp_status: check request status and response returns pending status with no response for a waiting request
statusReason: [When] Alice checks the status of her request -- EISDIR: illegal operation on a directory, read

[Killed] StringLiteral
src/tools/garp-status.ts:93:22
     const raw = await ctx.file.readJSON<unknown>(`requests/pending/${params.request_id}.json`);
     const request = parseRequestEnvelope(raw, params.request_id);
     const attachment_paths = resolveAttachmentPaths(tryParseEnvelope(raw, params.request_id), ctx.repoPath);
-    return { status: "pending", request, response: undefined, ...(attachment_paths ? { attachment_paths } : {}), ...(warning ? { warning } : {}) };
+    return { status: "", request, response: undefined, ...(attachment_paths ? { attachment_paths } : {}), ...(warning ? { warning } : {}) };
   }
 
killedBy: garp_status: check request status and response returns pending status with no response for a waiting request
statusReason: [When] Alice checks the status of her request -- expected '' to be 'pending' // Object.is equality

[Killed] ObjectLiteral
src/tools/garp-status.ts:93:12
     const raw = await ctx.file.readJSON<unknown>(`requests/pending/${params.request_id}.json`);
     const request = parseRequestEnvelope(raw, params.request_id);
     const attachment_paths = resolveAttachmentPaths(tryParseEnvelope(raw, params.request_id), ctx.repoPath);
-    return { status: "pending", request, response: undefined, ...(attachment_paths ? { attachment_paths } : {}), ...(warning ? { warning } : {}) };
+    return {};
   }
 
killedBy: garp_status: check request status and response returns pending status with no response for a waiting request
statusReason: [When] Alice checks the status of her request -- expected undefined to be 'pending' // Object.is equality

[Survived] StringLiteral
src/tools/garp-status.ts:97:52
   }
 
   // 3. Search active/ (Tier 2: brain service acknowledges request)
-  const activeFiles = await ctx.file.listDirectory("requests/active");
+  const activeFiles = await ctx.file.listDirectory("");
   if (activeFiles.includes(`${params.request_id}.json`)) {
     const raw = await ctx.file.readJSON<unknown>(`requests/active/${params.request_id}.json`);

[Killed] ConditionalExpression
src/tools/garp-status.ts:98:7
 
   // 3. Search active/ (Tier 2: brain service acknowledges request)
   const activeFiles = await ctx.file.listDirectory("requests/active");
-  if (activeFiles.includes(`${params.request_id}.json`)) {
+  if (true) {
     const raw = await ctx.file.readJSON<unknown>(`requests/active/${params.request_id}.json`);
     const request = parseRequestEnvelope(raw, params.request_id);
killedBy: garp_status: check request status and response returns completed status with full response for a finished request
statusReason: [When] Alice checks the status of her request -- ENOENT: no such file or directory, open '/var/folders/3j/t9wfhf615y903ky6m76j7sx80000gn/T/garp-accept-rrcj7o/alice/requests/active/req-20260221-143022-alice-a1b2.json'

[NoCoverage] BlockStatement
src/tools/garp-status.ts:98:58
 
   // 3. Search active/ (Tier 2: brain service acknowledges request)
   const activeFiles = await ctx.file.listDirectory("requests/active");
-  if (activeFiles.includes(`${params.request_id}.json`)) {
-    const raw = await ctx.file.readJSON<unknown>(`requests/active/${params.request_id}.json`);
-    const request = parseRequestEnvelope(raw, params.request_id);
-    const attachment_paths = resolveAttachmentPaths(tryParseEnvelope(raw, params.request_id), ctx.repoPath);
-    return { status: "active", request, response: undefined, ...(attachment_paths ? { attachment_paths } : {}), ...(warning ? { warning } : {}) };
-  }
+  if (activeFiles.includes(`${params.request_id}.json`)) {}
 
   // 4. Search completed/

[NoCoverage] StringLiteral
src/tools/garp-status.ts:99:50
   // 3. Search active/ (Tier 2: brain service acknowledges request)
   const activeFiles = await ctx.file.listDirectory("requests/active");
   if (activeFiles.includes(`${params.request_id}.json`)) {
-    const raw = await ctx.file.readJSON<unknown>(`requests/active/${params.request_id}.json`);
+    const raw = await ctx.file.readJSON<unknown>(``);
     const request = parseRequestEnvelope(raw, params.request_id);
     const attachment_paths = resolveAttachmentPaths(tryParseEnvelope(raw, params.request_id), ctx.repoPath);

[NoCoverage] ObjectLiteral
src/tools/garp-status.ts:102:12
     const raw = await ctx.file.readJSON<unknown>(`requests/active/${params.request_id}.json`);
     const request = parseRequestEnvelope(raw, params.request_id);
     const attachment_paths = resolveAttachmentPaths(tryParseEnvelope(raw, params.request_id), ctx.repoPath);
-    return { status: "active", request, response: undefined, ...(attachment_paths ? { attachment_paths } : {}), ...(warning ? { warning } : {}) };
+    return {};
   }
 

[Killed] StringLiteral
src/tools/garp-status.ts:106:55
   }
 
   // 4. Search completed/
-  const completedFiles = await ctx.file.listDirectory("requests/completed");
+  const completedFiles = await ctx.file.listDirectory("");
   if (completedFiles.includes(`${params.request_id}.json`)) {
     const raw = await ctx.file.readJSON<unknown>(`requests/completed/${params.request_id}.json`);
killedBy: garp_status: check request status and response returns completed status with full response for a finished request
statusReason: [When] Alice checks the status of her request -- Request req-20260221-143022-alice-a1b2 not found in any directory

[Killed] BlockStatement
src/tools/garp-status.ts:107:61
 
   // 4. Search completed/
   const completedFiles = await ctx.file.listDirectory("requests/completed");
-  if (completedFiles.includes(`${params.request_id}.json`)) {
-    const raw = await ctx.file.readJSON<unknown>(`requests/completed/${params.request_id}.json`);
-    const request = parseRequestEnvelope(raw, params.request_id);
-    const response = parseResponseEnvelope(await ctx.file.readJSON<unknown>(`responses/${params.request_id}.json`), params.request_id);
-    const attachment_paths = resolveAttachmentPaths(tryParseEnvelope(raw, params.request_id), ctx.repoPath);
-    return { status: "completed", request, response, ...(attachment_paths ? { attachment_paths } : {}), ...(warning ? { warning } : {}) };
-  }
+  if (completedFiles.includes(`${params.request_id}.json`)) {}
 
   // 5. Search cancelled/
killedBy: garp_status: check request status and response returns completed status with full response for a finished request
statusReason: [When] Alice checks the status of her request -- Request req-20260221-143022-alice-a1b2 not found in any directory

[Killed] ConditionalExpression
src/tools/garp-status.ts:107:7
 
   // 4. Search completed/
   const completedFiles = await ctx.file.listDirectory("requests/completed");
-  if (completedFiles.includes(`${params.request_id}.json`)) {
+  if (false) {
     const raw = await ctx.file.readJSON<unknown>(`requests/completed/${params.request_id}.json`);
     const request = parseRequestEnvelope(raw, params.request_id);
killedBy: garp_status: check request status and response returns completed status with full response for a finished request
statusReason: [When] Alice checks the status of her request -- Request req-20260221-143022-alice-a1b2 not found in any directory

[Killed] StringLiteral
src/tools/garp-status.ts:108:50
   // 4. Search completed/
   const completedFiles = await ctx.file.listDirectory("requests/completed");
   if (completedFiles.includes(`${params.request_id}.json`)) {
-    const raw = await ctx.file.readJSON<unknown>(`requests/completed/${params.request_id}.json`);
+    const raw = await ctx.file.readJSON<unknown>(``);
     const request = parseRequestEnvelope(raw, params.request_id);
     const response = parseResponseEnvelope(await ctx.file.readJSON<unknown>(`responses/${params.request_id}.json`), params.request_id);
killedBy: garp_status: check request status and response returns completed status with full response for a finished request
statusReason: [When] Alice checks the status of her request -- EISDIR: illegal operation on a directory, read

[NoCoverage] ObjectLiteral
src/tools/garp-status.ts:112:77
     const request = parseRequestEnvelope(raw, params.request_id);
     const response = parseResponseEnvelope(await ctx.file.readJSON<unknown>(`responses/${params.request_id}.json`), params.request_id);
     const attachment_paths = resolveAttachmentPaths(tryParseEnvelope(raw, params.request_id), ctx.repoPath);
-    return { status: "completed", request, response, ...(attachment_paths ? { attachment_paths } : {}), ...(warning ? { warning } : {}) };
+    return { status: "completed", request, response, ...(attachment_paths ? {} : {}), ...(warning ? { warning } : {}) };
   }
 

[Killed] StringLiteral
src/tools/garp-status.ts:116:55
   }
 
   // 5. Search cancelled/
-  const cancelledFiles = await ctx.file.listDirectory("requests/cancelled");
+  const cancelledFiles = await ctx.file.listDirectory("");
   if (cancelledFiles.includes(`${params.request_id}.json`)) {
     const raw = await ctx.file.readJSON<unknown>(`requests/cancelled/${params.request_id}.json`);
killedBy: garp_status: check request status and response returns cancelled status when request is in cancelled/
statusReason: [When] Alice checks the status of her cancelled request -- Request req-20260221-143022-alice-a1b2 not found in any directory

[Killed] BlockStatement
src/tools/garp-status.ts:117:61
 
   // 5. Search cancelled/
   const cancelledFiles = await ctx.file.listDirectory("requests/cancelled");
-  if (cancelledFiles.includes(`${params.request_id}.json`)) {
-    const raw = await ctx.file.readJSON<unknown>(`requests/cancelled/${params.request_id}.json`);
-    const request = parseRequestEnvelope(raw, params.request_id);
-    const attachment_paths = resolveAttachmentPaths(tryParseEnvelope(raw, params.request_id), ctx.repoPath);
-    return { status: "cancelled", request, ...(attachment_paths ? { attachment_paths } : {}), ...(warning ? { warning } : {}) };
-  }
+  if (cancelledFiles.includes(`${params.request_id}.json`)) {}
 
   // 6. Not found in pending/, active/, completed/, or cancelled/
killedBy: garp_status: check request status and response returns cancelled status when request is in cancelled/
statusReason: [When] Alice checks the status of her cancelled request -- Request req-20260221-143022-alice-a1b2 not found in any directory

[Killed] ConditionalExpression
src/tools/garp-status.ts:117:7
 
   // 5. Search cancelled/
   const cancelledFiles = await ctx.file.listDirectory("requests/cancelled");
-  if (cancelledFiles.includes(`${params.request_id}.json`)) {
+  if (true) {
     const raw = await ctx.file.readJSON<unknown>(`requests/cancelled/${params.request_id}.json`);
     const request = parseRequestEnvelope(raw, params.request_id);
killedBy: garp_status: check request status and response returns an error when request ID does not exist in any directory
statusReason: [When] Alice checks status of a non-existent request -- expected [Function] to throw error matching /not found/i but got 'ENOENT: no such file or directory, op…'

[NoCoverage] ObjectLiteral
src/tools/garp-status.ts:121:109
     const raw = await ctx.file.readJSON<unknown>(`requests/cancelled/${params.request_id}.json`);
     const request = parseRequestEnvelope(raw, params.request_id);
     const attachment_paths = resolveAttachmentPaths(tryParseEnvelope(raw, params.request_id), ctx.repoPath);
-    return { status: "cancelled", request, ...(attachment_paths ? { attachment_paths } : {}), ...(warning ? { warning } : {}) };
+    return { status: "cancelled", request, ...(attachment_paths ? { attachment_paths } : {}), ...(warning ? {} : {}) };
   }
 
