[Killed] ObjectLiteral
src/schemas.ts:25:35
 // Attachments
 // ---------------------------------------------------------------------------
 
-const AttachmentSchema = z.object({
-  filename: z.string(),
-  description: z.string(),
-});
+const AttachmentSchema = z.object({});
 
 export type Attachment = z.infer<typeof AttachmentSchema>;
killedBy: garp_status: check request status and response returns thread_id and attachments in the request data when present
statusReason: [When] Alice checks the status of her request -- The "path" argument must be of type string. Received undefined

[Killed] ObjectLiteral
src/schemas.ts:49:47
 // Request Envelope
 // ---------------------------------------------------------------------------
 
-export const RequestEnvelopeSchema = z.object({
-  request_id: z.string(),
-  thread_id: z.string().optional(),
-  request_type: z.string(),
-  sender: UserRefSchema,
-  recipient: UserRefSchema,
-  status: z.string(),
-  created_at: z.string(),
-  deadline: z.string().nullable().optional(),
-  context_bundle: z.record(z.string(), z.unknown()),
-  expected_response: z.record(z.string(), z.unknown()).optional(),
-  attachments: z.array(AttachmentSchema).optional(),
-  amendments: z.array(AmendmentEntrySchema).optional(),
-  cancel_reason: z.string().optional(),
-});
+export const RequestEnvelopeSchema = z.object({});
 
 export type RequestEnvelope = z.infer<typeof RequestEnvelopeSchema>;
killedBy: garp_status: check request status and response includes the original request data in the status response
statusReason: [When] Alice checks status -- expected {} to match object { …(4) }

[Killed] ObjectLiteral
src/schemas.ts:71:48
 // Response Envelope
 // ---------------------------------------------------------------------------
 
-export const ResponseEnvelopeSchema = z.object({
-  request_id: z.string(),
-  responder: UserRefSchema,
-  responded_at: z.string(),
-  response_bundle: z.record(z.string(), z.unknown()),
-});
+export const ResponseEnvelopeSchema = z.object({});
 
 export type ResponseEnvelope = z.infer<typeof ResponseEnvelopeSchema>;
killedBy: garp_status: check request status and response returns completed status with full response for a finished request
statusReason: [When] Alice checks the status of her request -- Cannot read properties of undefined (reading 'display_name')
