[Killed] BlockStatement
src/skill-loader.ts:59:16
   const mdPath = `skills/${skillName}/SKILL.md`;
 
   const exists = await file.fileExists(mdPath);
-  if (!exists) {
-    return undefined;
-  }
+  if (!exists) {}
 
   const content = await file.readText(mdPath);
killedBy: garp_discover: discover available request types and team skips skill directories that have no SKILL.md
statusReason: [When] an agent calls garp_discover -- ENOENT: no such file or directory, open '/var/folders/3j/t9wfhf615y903ky6m76j7sx80000gn/T/garp-accept-nuahJS/alice/skills/empty-skill/SKILL.md'

[Killed] ConditionalExpression
src/skill-loader.ts:59:7
   const mdPath = `skills/${skillName}/SKILL.md`;
 
   const exists = await file.fileExists(mdPath);
-  if (!exists) {
+  if (false) {
     return undefined;
   }
killedBy: garp_discover: discover available request types and team skips skill directories that have no SKILL.md
statusReason: [When] an agent calls garp_discover -- ENOENT: no such file or directory, open '/var/folders/3j/t9wfhf615y903ky6m76j7sx80000gn/T/garp-accept-H5dI7c/alice/skills/empty-skill/SKILL.md'

[Killed] ConditionalExpression
src/skill-loader.ts:67:7
   const frontmatter = extractFrontmatter(content);
 
   // If YAML frontmatter is present, parse it (primary path)
-  if (frontmatter !== undefined) {
+  if (true) {
     let parsed: Record<string, unknown>;
     try {
killedBy: garp_discover: discover available request types and team lists all available skills with metadata when called with no query
statusReason: [Then] the result contains 4 skill entries sorted alphabetically by name -- expected [] to have a length of 4 but got +0

[Killed] EqualityOperator
src/skill-loader.ts:67:7
   const frontmatter = extractFrontmatter(content);
 
   // If YAML frontmatter is present, parse it (primary path)
-  if (frontmatter !== undefined) {
+  if (frontmatter === undefined) {
     let parsed: Record<string, unknown>;
     try {
killedBy: garp_discover: discover available request types and team discovers available request types and team members from YAML skill contracts
statusReason: [Then] the catalog includes all installed skills sorted by name -- expected [] to have a length of 3 but got +0

[Killed] BlockStatement
src/skill-loader.ts:69:9
   // If YAML frontmatter is present, parse it (primary path)
   if (frontmatter !== undefined) {
     let parsed: Record<string, unknown>;
-    try {
-      parsed = parseYaml(frontmatter) as Record<string, unknown>;
-    } catch {
+    try {} catch {
       return undefined;
     }
killedBy: garp_discover: discover available request types and team discovers available request types and team members from YAML skill contracts
statusReason: [Then] the catalog includes all installed skills sorted by name -- expected [] to have a length of 3 but got +0

[Survived] BlockStatement
src/skill-loader.ts:71:13
     let parsed: Record<string, unknown>;
     try {
       parsed = parseYaml(frontmatter) as Record<string, unknown>;
-    } catch {
-      return undefined;
-    }
+    } catch {}
 
     // Empty frontmatter parses as null

[Killed] ConditionalExpression
src/skill-loader.ts:76:9
     }
 
     // Empty frontmatter parses as null
-    if (!parsed || typeof parsed !== "object") {
+    if (false) {
       return undefined;
     }
killedBy: garp_discover: discover available request types and team handles SKILL.md with valid frontmatter delimiters but empty YAML
statusReason: [When] an agent calls garp_discover -- Cannot read properties of null (reading 'name')

[Killed] EqualityOperator
src/skill-loader.ts:76:20
     }
 
     // Empty frontmatter parses as null
-    if (!parsed || typeof parsed !== "object") {
+    if (!parsed || typeof parsed === "object") {
       return undefined;
     }
killedBy: garp_discover: discover available request types and team discovers available request types and team members from YAML skill contracts
statusReason: [Then] the catalog includes all installed skills sorted by name -- expected [] to have a length of 3 but got +0

[Survived] ConditionalExpression
src/skill-loader.ts:80:18
       return undefined;
     }
 
-    const name = typeof parsed.name === "string" ? parsed.name : skillName;
+    const name = false ? parsed.name : skillName;
     const version =
       typeof parsed.version === "string" ? parsed.version : undefined;

[Survived] ConditionalExpression
src/skill-loader.ts:80:18
       return undefined;
     }
 
-    const name = typeof parsed.name === "string" ? parsed.name : skillName;
+    const name = true ? parsed.name : skillName;
     const version =
       typeof parsed.version === "string" ? parsed.version : undefined;

[Killed] ConditionalExpression
src/skill-loader.ts:82:7
 
     const name = typeof parsed.name === "string" ? parsed.name : skillName;
     const version =
-      typeof parsed.version === "string" ? parsed.version : undefined;
+      false ? parsed.version : undefined;
     const description =
       typeof parsed.description === "string" ? parsed.description : "";
killedBy: skill-loader: version field extracts version when present
statusReason: expected undefined to be '1.0.0' // Object.is equality

[Killed] EqualityOperator
src/skill-loader.ts:82:7
 
     const name = typeof parsed.name === "string" ? parsed.name : skillName;
     const version =
-      typeof parsed.version === "string" ? parsed.version : undefined;
+      typeof parsed.version !== "string" ? parsed.version : undefined;
     const description =
       typeof parsed.description === "string" ? parsed.description : "";
killedBy: skill-loader: version field extracts version when present
statusReason: expected undefined to be '1.0.0' // Object.is equality

[Killed] ConditionalExpression
src/skill-loader.ts:84:7
     const version =
       typeof parsed.version === "string" ? parsed.version : undefined;
     const description =
-      typeof parsed.description === "string" ? parsed.description : "";
+      false ? parsed.description : "";
 
     const whenToUse = normalizeWhenToUse(parsed.when_to_use);
killedBy: skill-loader: valid YAML frontmatter parses ask skill metadata from YAML frontmatter
statusReason: expected '' to be 'A general-purpose request for when yo…' // Object.is equality

[Killed] EqualityOperator
src/skill-loader.ts:84:7
     const version =
       typeof parsed.version === "string" ? parsed.version : undefined;
     const description =
-      typeof parsed.description === "string" ? parsed.description : "";
+      typeof parsed.description !== "string" ? parsed.description : "";
 
     const whenToUse = normalizeWhenToUse(parsed.when_to_use);
killedBy: skill-loader: valid YAML frontmatter parses ask skill metadata from YAML frontmatter
statusReason: expected '' to be 'A general-purpose request for when yo…' // Object.is equality

[Killed] EqualityOperator
src/skill-loader.ts:89:22
     const whenToUse = normalizeWhenToUse(parsed.when_to_use);
     const contextBundle = parseBundleSpec(parsed.context_bundle);
     const responseBundle = parseBundleSpec(parsed.response_bundle);
-    const hasBrain = parsed.brain_processing != null;
+    const hasBrain = parsed.brain_processing == null;
 
     return {
killedBy: skill-loader: brain_processing sets has_brain to true when brain_processing section is present
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/skill-loader.ts:89:22
     const whenToUse = normalizeWhenToUse(parsed.when_to_use);
     const contextBundle = parseBundleSpec(parsed.context_bundle);
     const responseBundle = parseBundleSpec(parsed.response_bundle);
-    const hasBrain = parsed.brain_processing != null;
+    const hasBrain = false;
 
     return {
killedBy: skill-loader: brain_processing sets has_brain to true when brain_processing section is present
statusReason: expected false to be true // Object.is equality

[Killed] ObjectLiteral
src/skill-loader.ts:91:12
     const responseBundle = parseBundleSpec(parsed.response_bundle);
     const hasBrain = parsed.brain_processing != null;
 
-    return {
-      name,
-      version,
-      description,
-      when_to_use: whenToUse,
-      context_bundle: contextBundle,
-      response_bundle: responseBundle,
-      has_brain: hasBrain,
-    };
+    return {};
   }
 
killedBy: skill-loader: valid YAML frontmatter parses ask skill metadata from YAML frontmatter
statusReason: expected undefined to be 'ask' // Object.is equality

[Killed] ConditionalExpression
src/skill-loader.ts:107:7
   // structured Markdown tables (Context Bundle Fields / Response Structure).
   // A SKILL.md without any field tables is not a complete old-format skill.
   const mdParsed = parseMarkdownTables(content);
-  if (!mdParsed.contextFields.length && !mdParsed.responseFields.length) {
+  if (false) {
     return undefined;
   }
killedBy: skill-loader: error handling returns undefined for SKILL.md without frontmatter delimiters
statusReason: expected { name: 'no-fm', …(5) } to be undefined

[Killed] BlockStatement
src/skill-loader.ts:107:74
   // structured Markdown tables (Context Bundle Fields / Response Structure).
   // A SKILL.md without any field tables is not a complete old-format skill.
   const mdParsed = parseMarkdownTables(content);
-  if (!mdParsed.contextFields.length && !mdParsed.responseFields.length) {
-    return undefined;
-  }
+  if (!mdParsed.contextFields.length && !mdParsed.responseFields.length) {}
 
   // Check for schema.json to override field extraction
killedBy: skill-loader: error handling returns undefined for SKILL.md without frontmatter delimiters
statusReason: expected { name: 'no-fm', …(5) } to be undefined

[Killed] StringLiteral
src/skill-loader.ts:112:22
   }
 
   // Check for schema.json to override field extraction
-  const schemaPath = `skills/${skillName}/schema.json`;
+  const schemaPath = ``;
   const schema = await readSchemaIfValid(file, schemaPath);
 
killedBy: skill-loader: schema.json fallback for old-format SKILL.md uses schema.json when present alongside old-format SKILL.md
statusReason: expected [] to deeply equal [ 'question' ]

[Killed] BlockStatement
src/skill-loader.ts:118:15
   let contextBundle: BundleSpec;
   let responseBundle: BundleSpec;
 
-  if (schema) {
-    contextBundle = schemaBundleToBundleSpec(schema.context_bundle);
-    responseBundle = schemaBundleToBundleSpec(schema.response_bundle);
-  } else {
+  if (schema) {} else {
     contextBundle = fieldListToBundleSpec(mdParsed.contextFields);
     responseBundle = fieldListToBundleSpec(mdParsed.responseFields);
killedBy: skill-loader: schema.json fallback for old-format SKILL.md uses schema.json when present alongside old-format SKILL.md
statusReason: Cannot read properties of undefined (reading 'required')

[Killed] ConditionalExpression
src/skill-loader.ts:118:7
   let contextBundle: BundleSpec;
   let responseBundle: BundleSpec;
 
-  if (schema) {
+  if (true) {
     contextBundle = schemaBundleToBundleSpec(schema.context_bundle);
     responseBundle = schemaBundleToBundleSpec(schema.response_bundle);
killedBy: skill-loader: Markdown table fallback (old-format SKILL.md) extracts fields from markdown tables with correct type:'string' and description:''
statusReason: Cannot read properties of undefined (reading 'context_bundle')

[Killed] BlockStatement
src/skill-loader.ts:121:10
   if (schema) {
     contextBundle = schemaBundleToBundleSpec(schema.context_bundle);
     responseBundle = schemaBundleToBundleSpec(schema.response_bundle);
-  } else {
-    contextBundle = fieldListToBundleSpec(mdParsed.contextFields);
-    responseBundle = fieldListToBundleSpec(mdParsed.responseFields);
-  }
+  } else {}
 
   return {
killedBy: skill-loader: Markdown table fallback (old-format SKILL.md) extracts fields from markdown tables with correct type:'string' and description:''
statusReason: Cannot read properties of undefined (reading 'fields')

[Killed] ArrayDeclaration
src/skill-loader.ts:129:39
   return {
     name: skillName,
     description: mdParsed.description,
-    when_to_use: mdParsed.whenToUse ? [mdParsed.whenToUse] : [],
+    when_to_use: mdParsed.whenToUse ? [] : [],
     context_bundle: contextBundle,
     response_bundle: responseBundle,
killedBy: skill-loader: Markdown table fallback (old-format SKILL.md) extracts when_to_use from ## When To Use section with dash prefix stripped
statusReason: expected [] to deeply equal [ 'First use case Second use case' ]

[Survived] ArrayDeclaration
src/skill-loader.ts:129:62
   return {
     name: skillName,
     description: mdParsed.description,
-    when_to_use: mdParsed.whenToUse ? [mdParsed.whenToUse] : [],
+    when_to_use: mdParsed.whenToUse ? [mdParsed.whenToUse] : ["Stryker was here"],
     context_bundle: contextBundle,
     response_bundle: responseBundle,

[Killed] BooleanLiteral
src/skill-loader.ts:132:16
     when_to_use: mdParsed.whenToUse ? [mdParsed.whenToUse] : [],
     context_bundle: contextBundle,
     response_bundle: responseBundle,
-    has_brain: false,
+    has_brain: true,
   };
 }
killedBy: garp_discover: discover available request types and team falls back to SKILL.md parsing when no schema.json exists
statusReason: [Then] the ask entry has has_brain set to false (no brain processing) -- expected true to be false // Object.is equality

[Killed] BlockStatement
src/skill-loader.ts:146:34
 export async function getRequiredContextFieldsFromYaml(
   file: FilePort,
   skillName: string,
-): Promise<string[] | undefined> {
-  const metadata = await loadSkillMetadata(file, skillName);
-  if (!metadata) {
-    // Last-resort fallback: check schema.json directly (supports
-    // old workflows where schema.json exists but SKILL.md is empty)
-    const schemaPath = `skills/${skillName}/schema.json`;
-    const schema = await readSchemaIfValid(file, schemaPath);
-    if (schema?.context_bundle?.required?.length) {
-      return schema.context_bundle.required;
-    }
-    return undefined;
-  }
-  const required = metadata.context_bundle.required;
-  return required.length > 0 ? required : undefined;
-}
+): Promise<string[] | undefined> {}
 
 // ---------------------------------------------------------------------------
killedBy: skill-loader: getRequiredContextFieldsFromYaml returns required context fields from YAML frontmatter
statusReason: expected undefined to be defined

[Killed] ConditionalExpression
src/skill-loader.ts:148:7
   skillName: string,
 ): Promise<string[] | undefined> {
   const metadata = await loadSkillMetadata(file, skillName);
-  if (!metadata) {
+  if (true) {
     // Last-resort fallback: check schema.json directly (supports
     // old workflows where schema.json exists but SKILL.md is empty)
killedBy: skill-loader: getRequiredContextFieldsFromYaml returns required context fields from YAML frontmatter
statusReason: expected undefined to be defined

[Killed] BooleanLiteral
src/skill-loader.ts:148:7
   skillName: string,
 ): Promise<string[] | undefined> {
   const metadata = await loadSkillMetadata(file, skillName);
-  if (!metadata) {
+  if (metadata) {
     // Last-resort fallback: check schema.json directly (supports
     // old workflows where schema.json exists but SKILL.md is empty)
killedBy: skill-loader: getRequiredContextFieldsFromYaml returns required context fields from YAML frontmatter
statusReason: expected undefined to be defined

[Killed] StringLiteral
src/skill-loader.ts:151:24
   if (!metadata) {
     // Last-resort fallback: check schema.json directly (supports
     // old workflows where schema.json exists but SKILL.md is empty)
-    const schemaPath = `skills/${skillName}/schema.json`;
+    const schemaPath = ``;
     const schema = await readSchemaIfValid(file, schemaPath);
     if (schema?.context_bundle?.required?.length) {
killedBy: skill-loader: getRequiredContextFieldsFromYaml schema.json fallback falls back to schema.json when SKILL.md has empty frontmatter
statusReason: expected undefined to deeply equal [ 'field_a', 'field_b' ]

[Killed] OptionalChaining
src/skill-loader.ts:153:9
     // old workflows where schema.json exists but SKILL.md is empty)
     const schemaPath = `skills/${skillName}/schema.json`;
     const schema = await readSchemaIfValid(file, schemaPath);
-    if (schema?.context_bundle?.required?.length) {
+    if (schema.context_bundle?.required?.length) {
       return schema.context_bundle.required;
     }
killedBy: skill contract: skill validation and auto-loading newly created skill type is available after git pull
statusReason: [Then] Alice can submit a code-review request -- Cannot read properties of undefined (reading 'context_bundle')

[Killed] BlockStatement
src/skill-loader.ts:153:51
     // old workflows where schema.json exists but SKILL.md is empty)
     const schemaPath = `skills/${skillName}/schema.json`;
     const schema = await readSchemaIfValid(file, schemaPath);
-    if (schema?.context_bundle?.required?.length) {
-      return schema.context_bundle.required;
-    }
+    if (schema?.context_bundle?.required?.length) {}
     return undefined;
   }
killedBy: skill-loader: getRequiredContextFieldsFromYaml schema.json fallback falls back to schema.json when SKILL.md has empty frontmatter
statusReason: expected undefined to deeply equal [ 'field_a', 'field_b' ]

[Killed] EqualityOperator
src/skill-loader.ts:159:10
     return undefined;
   }
   const required = metadata.context_bundle.required;
-  return required.length > 0 ? required : undefined;
+  return required.length <= 0 ? required : undefined;
 }
 
killedBy: schema.json: typed skill contracts and validation warnings warns on missing required fields and still submits the request successfully
statusReason: [Then] the response includes validation_warnings mentioning missing fields -- expected undefined to be defined

[Killed] ConditionalExpression
src/skill-loader.ts:159:10
     return undefined;
   }
   const required = metadata.context_bundle.required;
-  return required.length > 0 ? required : undefined;
+  return false ? required : undefined;
 }
 
killedBy: schema.json: typed skill contracts and validation warnings warns on missing required fields and still submits the request successfully
statusReason: [Then] the response includes validation_warnings mentioning missing fields -- expected undefined to be defined

[Killed] BlockStatement
src/skill-loader.ts:170:66
  * Extract the raw YAML string between the opening and closing `---`
  * delimiters. Returns undefined if delimiters are not found.
  */
-function extractFrontmatter(content: string): string | undefined {
-  // Frontmatter must start at the very beginning of the file
-  if (!content.startsWith("---")) {
-    return undefined;
-  }
-
-  // Find the closing delimiter (second ---)
-  const closingIndex = content.indexOf("\n---", 3);
-  if (closingIndex === -1) {
-    return undefined;
-  }
-
-  // Extract the YAML between the delimiters
-  const yaml = content.slice(content.indexOf("\n") + 1, closingIndex);
-  return yaml;
-}
+function extractFrontmatter(content: string): string | undefined {}
 
 /**
killedBy: garp_discover: discover available request types and team discovers available request types and team members from YAML skill contracts
statusReason: [Then] the catalog includes all installed skills sorted by name -- expected [] to have a length of 3 but got +0

[Killed] MethodExpression
src/skill-loader.ts:172:8
  */
 function extractFrontmatter(content: string): string | undefined {
   // Frontmatter must start at the very beginning of the file
-  if (!content.startsWith("---")) {
+  if (!content.endsWith("---")) {
     return undefined;
   }
killedBy: garp_discover: discover available request types and team discovers available request types and team members from YAML skill contracts
statusReason: [Then] the catalog includes all installed skills sorted by name -- expected [] to have a length of 3 but got +0

[Killed] ConditionalExpression
src/skill-loader.ts:172:7
  */
 function extractFrontmatter(content: string): string | undefined {
   // Frontmatter must start at the very beginning of the file
-  if (!content.startsWith("---")) {
+  if (true) {
     return undefined;
   }
killedBy: garp_discover: discover available request types and team discovers available request types and team members from YAML skill contracts
statusReason: [Then] the catalog includes all installed skills sorted by name -- expected [] to have a length of 3 but got +0

[Killed] EqualityOperator
src/skill-loader.ts:178:7
 
   // Find the closing delimiter (second ---)
   const closingIndex = content.indexOf("\n---", 3);
-  if (closingIndex === -1) {
+  if (closingIndex !== -1) {
     return undefined;
   }
killedBy: skill-loader: valid YAML frontmatter parses ask skill metadata from YAML frontmatter
statusReason: expected undefined to be defined

[Killed] BlockStatement
src/skill-loader.ts:178:28
 
   // Find the closing delimiter (second ---)
   const closingIndex = content.indexOf("\n---", 3);
-  if (closingIndex === -1) {
-    return undefined;
-  }
+  if (closingIndex === -1) {}
 
   // Extract the YAML between the delimiters
killedBy: skill-loader: extractFrontmatter edge cases falls back to markdown parsing when --- exists but has no closing delimiter
statusReason: expected undefined to be defined

[Killed] ArithmeticOperator
src/skill-loader.ts:183:30
   }
 
   // Extract the YAML between the delimiters
-  const yaml = content.slice(content.indexOf("\n") + 1, closingIndex);
+  const yaml = content.slice(content.indexOf("\n") - 1, closingIndex);
   return yaml;
 }
killedBy: skill-loader: valid YAML frontmatter parses ask skill metadata from YAML frontmatter
statusReason: expected undefined to be defined

[Killed] MethodExpression
src/skill-loader.ts:183:16
   }
 
   // Extract the YAML between the delimiters
-  const yaml = content.slice(content.indexOf("\n") + 1, closingIndex);
+  const yaml = content;
   return yaml;
 }
killedBy: skill-loader: valid YAML frontmatter parses ask skill metadata from YAML frontmatter
statusReason: expected undefined to be defined

[Killed] BlockStatement
src/skill-loader.ts:191:53
  * Normalize when_to_use: a single string becomes a one-element array,
  * an array stays as-is.
  */
-function normalizeWhenToUse(raw: unknown): string[] {
-  if (Array.isArray(raw)) {
-    return raw.filter((item): item is string => typeof item === "string");
-  }
-  if (typeof raw === "string") {
-    return [raw];
-  }
-  return [];
-}
+function normalizeWhenToUse(raw: unknown): string[] {}
 
 // ---------------------------------------------------------------------------
killedBy: skill-loader: valid YAML frontmatter parses ask skill metadata from YAML frontmatter
statusReason: expected undefined to deeply equal [ …(3) ]

[Killed] ConditionalExpression
src/skill-loader.ts:192:7
  * an array stays as-is.
  */
 function normalizeWhenToUse(raw: unknown): string[] {
-  if (Array.isArray(raw)) {
+  if (true) {
     return raw.filter((item): item is string => typeof item === "string");
   }
killedBy: skill-loader: when_to_use normalization normalizes single string when_to_use to array
statusReason: raw.filter is not a function

[Killed] ConditionalExpression
src/skill-loader.ts:192:7
  * an array stays as-is.
  */
 function normalizeWhenToUse(raw: unknown): string[] {
-  if (Array.isArray(raw)) {
+  if (false) {
     return raw.filter((item): item is string => typeof item === "string");
   }
killedBy: skill-loader: valid YAML frontmatter parses ask skill metadata from YAML frontmatter
statusReason: expected [] to deeply equal [ …(3) ]

[Killed] ConditionalExpression
src/skill-loader.ts:193:49
  */
 function normalizeWhenToUse(raw: unknown): string[] {
   if (Array.isArray(raw)) {
-    return raw.filter((item): item is string => typeof item === "string");
+    return raw.filter((item): item is string => true);
   }
   if (typeof raw === "string") {
killedBy: skill-loader: when_to_use filters non-string items filters non-string items from when_to_use array
statusReason: expected [ 'Valid string item', 42, true, …(1) ] to deeply equal [ 'Valid string item', …(1) ]

[Killed] EqualityOperator
src/skill-loader.ts:193:49
  */
 function normalizeWhenToUse(raw: unknown): string[] {
   if (Array.isArray(raw)) {
-    return raw.filter((item): item is string => typeof item === "string");
+    return raw.filter((item): item is string => typeof item !== "string");
   }
   if (typeof raw === "string") {
killedBy: skill-loader: valid YAML frontmatter parses ask skill metadata from YAML frontmatter
statusReason: expected [] to deeply equal [ …(3) ]

[Killed] BlockStatement
src/skill-loader.ts:195:32
   if (Array.isArray(raw)) {
     return raw.filter((item): item is string => typeof item === "string");
   }
-  if (typeof raw === "string") {
-    return [raw];
-  }
+  if (typeof raw === "string") {}
   return [];
 }
killedBy: skill-loader: when_to_use normalization normalizes single string when_to_use to array
statusReason: expected [] to deeply equal [ Array(1) ]

[Killed] ConditionalExpression
src/skill-loader.ts:195:7
   if (Array.isArray(raw)) {
     return raw.filter((item): item is string => typeof item === "string");
   }
-  if (typeof raw === "string") {
+  if (true) {
     return [raw];
   }
killedBy: skill-loader: when_to_use filters non-string items returns empty array when when_to_use is a number
statusReason: expected [ 42 ] to deeply equal []

[Killed] ArrayDeclaration
src/skill-loader.ts:196:12
     return raw.filter((item): item is string => typeof item === "string");
   }
   if (typeof raw === "string") {
-    return [raw];
+    return [];
   }
   return [];
killedBy: skill-loader: when_to_use normalization normalizes single string when_to_use to array
statusReason: expected [] to deeply equal [ Array(1) ]

[Survived] StringLiteral
src/skill-loader.ts:220:24
   const lines = markdown.split("\n");
 
   let title = "";
-  let currentSection = "";
+  let currentSection = "Stryker was here!";
   const descriptionLines: string[] = [];
   const whenToUseLines: string[] = [];

[Killed] ArrayDeclaration
src/skill-loader.ts:224:40
   const descriptionLines: string[] = [];
   const whenToUseLines: string[] = [];
   const contextTableLines: string[] = [];
-  const responseTableLines: string[] = [];
+  const responseTableLines: string[] = ["Stryker was here"];
 
   for (const line of lines) {
killedBy: skill-loader: error handling returns undefined for SKILL.md without frontmatter delimiters
statusReason: expected { name: 'no-fm', …(5) } to be undefined

[Killed] ConditionalExpression
src/skill-loader.ts:227:9
   const responseTableLines: string[] = [];
 
   for (const line of lines) {
-    if (line.startsWith("# ") && !title) {
+    if (false) {
       title = line.slice(2).trim();
       currentSection = "description";
killedBy: skill-loader: Markdown table fallback (old-format SKILL.md) extracts description from lines between title and first ## section
statusReason: expected '' to be 'First line of description. Second lin…' // Object.is equality

[Killed] BlockStatement
src/skill-loader.ts:227:42
   const responseTableLines: string[] = [];
 
   for (const line of lines) {
-    if (line.startsWith("# ") && !title) {
-      title = line.slice(2).trim();
-      currentSection = "description";
-      continue;
-    }
+    if (line.startsWith("# ") && !title) {}
 
     if (line.startsWith("## ")) {
killedBy: skill-loader: Markdown table fallback (old-format SKILL.md) extracts description from lines between title and first ## section
statusReason: expected '' to be 'First line of description. Second lin…' // Object.is equality

[Survived] MethodExpression
src/skill-loader.ts:228:15
 
   for (const line of lines) {
     if (line.startsWith("# ") && !title) {
-      title = line.slice(2).trim();
+      title = line.slice(2);
       currentSection = "description";
       continue;

[Survived] MethodExpression
src/skill-loader.ts:228:15
 
   for (const line of lines) {
     if (line.startsWith("# ") && !title) {
-      title = line.slice(2).trim();
+      title = line.trim();
       currentSection = "description";
       continue;

[Killed] MethodExpression
src/skill-loader.ts:233:9
       continue;
     }
 
-    if (line.startsWith("## ")) {
+    if (line.endsWith("## ")) {
       const sectionName = line.slice(3).trim().toLowerCase();
       if (sectionName === "when to use") {
killedBy: garp_discover: discover available request types and team lists all available skills with metadata when called with no query
statusReason: [Then] the result contains 4 skill entries sorted alphabetically by name -- expected [] to have a length of 4 but got +0

[Killed] ConditionalExpression
src/skill-loader.ts:233:9
       continue;
     }
 
-    if (line.startsWith("## ")) {
+    if (true) {
       const sectionName = line.slice(3).trim().toLowerCase();
       if (sectionName === "when to use") {
killedBy: garp_discover: discover available request types and team lists all available skills with metadata when called with no query
statusReason: [Then] the result contains 4 skill entries sorted alphabetically by name -- expected [] to have a length of 4 but got +0

[Killed] MethodExpression
src/skill-loader.ts:234:27
     }
 
     if (line.startsWith("## ")) {
-      const sectionName = line.slice(3).trim().toLowerCase();
+      const sectionName = line.slice(3).trim().toUpperCase();
       if (sectionName === "when to use") {
         currentSection = "when_to_use";
killedBy: garp_discover: discover available request types and team lists all available skills with metadata when called with no query
statusReason: [Then] the result contains 4 skill entries sorted alphabetically by name -- expected [] to have a length of 4 but got +0
