[Killed] MethodExpression
src/skill-loader.ts:234:27
     }
 
     if (line.startsWith("## ")) {
-      const sectionName = line.slice(3).trim().toLowerCase();
+      const sectionName = line.trim().toLowerCase();
       if (sectionName === "when to use") {
         currentSection = "when_to_use";
killedBy: garp_discover: discover available request types and team lists all available skills with metadata when called with no query
statusReason: [Then] the result contains 4 skill entries sorted alphabetically by name -- expected [] to have a length of 4 but got +0

[Killed] ConditionalExpression
src/skill-loader.ts:235:11
 
     if (line.startsWith("## ")) {
       const sectionName = line.slice(3).trim().toLowerCase();
-      if (sectionName === "when to use") {
+      if (false) {
         currentSection = "when_to_use";
       } else if (sectionName === "context bundle fields") {
killedBy: garp_discover: discover available request types and team lists all available skills with metadata when called with no query
statusReason: [Then] each entry includes name, description, when_to_use (array), context_bundle, and response_bundle -- expected 0 to be greater than 0

[Killed] BlockStatement
src/skill-loader.ts:235:42
 
     if (line.startsWith("## ")) {
       const sectionName = line.slice(3).trim().toLowerCase();
-      if (sectionName === "when to use") {
-        currentSection = "when_to_use";
-      } else if (sectionName === "context bundle fields") {
+      if (sectionName === "when to use") {} else if (sectionName === "context bundle fields") {
         currentSection = "context_fields";
       } else if (sectionName === "response structure") {
killedBy: garp_discover: discover available request types and team lists all available skills with metadata when called with no query
statusReason: [Then] each entry includes name, description, when_to_use (array), context_bundle, and response_bundle -- expected 0 to be greater than 0

[Killed] EqualityOperator
src/skill-loader.ts:237:18
       const sectionName = line.slice(3).trim().toLowerCase();
       if (sectionName === "when to use") {
         currentSection = "when_to_use";
-      } else if (sectionName === "context bundle fields") {
+      } else if (sectionName !== "context bundle fields") {
         currentSection = "context_fields";
       } else if (sectionName === "response structure") {
killedBy: garp_discover: discover available request types and team extracts context and response field names from SKILL.md tables
statusReason: [Then] the sanity-check entry has context_bundle.fields from the SKILL.md table -- expected [ 'answer', 'evidence', …(2) ] to deeply equal ArrayContaining{…}

[Killed] ConditionalExpression
src/skill-loader.ts:237:18
       const sectionName = line.slice(3).trim().toLowerCase();
       if (sectionName === "when to use") {
         currentSection = "when_to_use";
-      } else if (sectionName === "context bundle fields") {
+      } else if (false) {
         currentSection = "context_fields";
       } else if (sectionName === "response structure") {
killedBy: garp_discover: discover available request types and team extracts context and response field names from SKILL.md tables
statusReason: [Then] the sanity-check entry has context_bundle.fields from the SKILL.md table -- expected [] to deeply equal ArrayContaining{…}

[Killed] EqualityOperator
src/skill-loader.ts:239:18
         currentSection = "when_to_use";
       } else if (sectionName === "context bundle fields") {
         currentSection = "context_fields";
-      } else if (sectionName === "response structure") {
+      } else if (sectionName !== "response structure") {
         currentSection = "response_fields";
       } else {
killedBy: garp_discover: discover available request types and team extracts context and response field names from SKILL.md tables
statusReason: [Then] the sanity-check entry has response_bundle.fields from the SKILL.md table -- expected [] to deeply equal ArrayContaining{…}

[Killed] BlockStatement
src/skill-loader.ts:239:56
         currentSection = "when_to_use";
       } else if (sectionName === "context bundle fields") {
         currentSection = "context_fields";
-      } else if (sectionName === "response structure") {
-        currentSection = "response_fields";
-      } else {
+      } else if (sectionName === "response structure") {} else {
         currentSection = "other";
       }
killedBy: garp_discover: discover available request types and team extracts context and response field names from SKILL.md tables
statusReason: [Then] the sanity-check entry has response_bundle.fields from the SKILL.md table -- expected [] to deeply equal ArrayContaining{…}

[Survived] BlockStatement
src/skill-loader.ts:241:14
         currentSection = "context_fields";
       } else if (sectionName === "response structure") {
         currentSection = "response_fields";
-      } else {
-        currentSection = "other";
-      }
+      } else {}
       continue;
     }

[Killed] ConditionalExpression
src/skill-loader.ts:248:7
     }
 
     switch (currentSection) {
-      case "description":
-        if (line.trim()) descriptionLines.push(line.trim());
-        break;
+      case "description":
       case "when_to_use":
         if (line.trim()) whenToUseLines.push(line.trim());
killedBy: skill-loader: Markdown table fallback (old-format SKILL.md) extracts description from lines between title and first ## section
statusReason: expected 'My Skill' to be 'First line of description. Second lin…' // Object.is equality

[Killed] ConditionalExpression
src/skill-loader.ts:249:13
 
     switch (currentSection) {
       case "description":
-        if (line.trim()) descriptionLines.push(line.trim());
+        if (false) descriptionLines.push(line.trim());
         break;
       case "when_to_use":
killedBy: skill-loader: Markdown table fallback (old-format SKILL.md) extracts description from lines between title and first ## section
statusReason: expected 'My Skill' to be 'First line of description. Second lin…' // Object.is equality

[Killed] ConditionalExpression
src/skill-loader.ts:249:13
 
     switch (currentSection) {
       case "description":
-        if (line.trim()) descriptionLines.push(line.trim());
+        if (true) descriptionLines.push(line.trim());
         break;
       case "when_to_use":
killedBy: skill-loader: Markdown table fallback (old-format SKILL.md) extracts description from lines between title and first ## section
statusReason: expected ' First line of description. Second li…' to be 'First line of description. Second lin…' // Object.is equality

[Killed] ConditionalExpression
src/skill-loader.ts:251:7
       case "description":
         if (line.trim()) descriptionLines.push(line.trim());
         break;
-      case "when_to_use":
-        if (line.trim()) whenToUseLines.push(line.trim());
-        break;
+      case "when_to_use":
       case "context_fields":
         if (line.includes("|")) contextTableLines.push(line);
killedBy: garp_discover: discover available request types and team lists all available skills with metadata when called with no query
statusReason: [Then] each entry includes name, description, when_to_use (array), context_bundle, and response_bundle -- expected 0 to be greater than 0

[Killed] ConditionalExpression
src/skill-loader.ts:252:13
         if (line.trim()) descriptionLines.push(line.trim());
         break;
       case "when_to_use":
-        if (line.trim()) whenToUseLines.push(line.trim());
+        if (false) whenToUseLines.push(line.trim());
         break;
       case "context_fields":
killedBy: skill-loader: Markdown table fallback (old-format SKILL.md) extracts when_to_use from ## When To Use section with dash prefix stripped
statusReason: expected [] to deeply equal [ 'First use case Second use case' ]

[Killed] ConditionalExpression
src/skill-loader.ts:252:13
         if (line.trim()) descriptionLines.push(line.trim());
         break;
       case "when_to_use":
-        if (line.trim()) whenToUseLines.push(line.trim());
+        if (true) whenToUseLines.push(line.trim());
         break;
       case "context_fields":
killedBy: skill-loader: Markdown table fallback (old-format SKILL.md) extracts when_to_use from ## When To Use section with dash prefix stripped
statusReason: expected [ 'First use case Second use case ' ] to deeply equal [ 'First use case Second use case' ]

[Killed] ConditionalExpression
src/skill-loader.ts:254:7
       case "when_to_use":
         if (line.trim()) whenToUseLines.push(line.trim());
         break;
-      case "context_fields":
-        if (line.includes("|")) contextTableLines.push(line);
-        break;
+      case "context_fields":
       case "response_fields":
         if (line.includes("|")) responseTableLines.push(line);
killedBy: garp_discover: discover available request types and team extracts context and response field names from SKILL.md tables
statusReason: [Then] the sanity-check entry has context_bundle.fields from the SKILL.md table -- expected [] to deeply equal ArrayContaining{…}

[Killed] StringLiteral
src/skill-loader.ts:254:12
       case "when_to_use":
         if (line.trim()) whenToUseLines.push(line.trim());
         break;
-      case "context_fields":
+      case "":
         if (line.includes("|")) contextTableLines.push(line);
         break;
killedBy: garp_discover: discover available request types and team extracts context and response field names from SKILL.md tables
statusReason: [Then] the sanity-check entry has context_bundle.fields from the SKILL.md table -- expected [] to deeply equal ArrayContaining{…}

[Killed] ConditionalExpression
src/skill-loader.ts:255:13
         if (line.trim()) whenToUseLines.push(line.trim());
         break;
       case "context_fields":
-        if (line.includes("|")) contextTableLines.push(line);
+        if (false) contextTableLines.push(line);
         break;
       case "response_fields":
killedBy: garp_discover: discover available request types and team extracts context and response field names from SKILL.md tables
statusReason: [Then] the sanity-check entry has context_bundle.fields from the SKILL.md table -- expected [] to deeply equal ArrayContaining{…}

[Killed] ConditionalExpression
src/skill-loader.ts:255:13
         if (line.trim()) whenToUseLines.push(line.trim());
         break;
       case "context_fields":
-        if (line.includes("|")) contextTableLines.push(line);
+        if (true) contextTableLines.push(line);
         break;
       case "response_fields":
killedBy: skill-loader: Markdown table fallback (old-format SKILL.md) only includes pipe-containing lines from table sections
statusReason: expected [ …(3) ] to deeply equal [ 'ctx_field' ]

[Killed] ConditionalExpression
src/skill-loader.ts:257:7
       case "context_fields":
         if (line.includes("|")) contextTableLines.push(line);
         break;
-      case "response_fields":
-        if (line.includes("|")) responseTableLines.push(line);
-        break;
+      case "response_fields":
     }
   }
killedBy: garp_discover: discover available request types and team extracts context and response field names from SKILL.md tables
statusReason: [Then] the sanity-check entry has response_bundle.fields from the SKILL.md table -- expected [] to deeply equal ArrayContaining{…}

[Killed] ConditionalExpression
src/skill-loader.ts:258:13
         if (line.includes("|")) contextTableLines.push(line);
         break;
       case "response_fields":
-        if (line.includes("|")) responseTableLines.push(line);
+        if (false) responseTableLines.push(line);
         break;
     }
killedBy: garp_discover: discover available request types and team extracts context and response field names from SKILL.md tables
statusReason: [Then] the sanity-check entry has response_bundle.fields from the SKILL.md table -- expected [] to deeply equal ArrayContaining{…}

[Survived] ConditionalExpression
src/skill-loader.ts:258:13
         if (line.includes("|")) contextTableLines.push(line);
         break;
       case "response_fields":
-        if (line.includes("|")) responseTableLines.push(line);
+        if (true) responseTableLines.push(line);
         break;
     }

[Killed] ConditionalExpression
src/skill-loader.ts:264:18
   }
 
   return {
-    description: descriptionLines.join(" ") || title,
+    description: false,
     whenToUse: whenToUseLines.map((l) => l.replace(/^- /, "")).join(" "),
     contextFields: extractTableFieldNames(contextTableLines),
killedBy: skill-loader: Markdown table fallback (old-format SKILL.md) extracts description from lines between title and first ## section
statusReason: expected false to be 'First line of description. Second lin…' // Object.is equality

[Killed] ConditionalExpression
src/skill-loader.ts:264:18
   }
 
   return {
-    description: descriptionLines.join(" ") || title,
+    description: true,
     whenToUse: whenToUseLines.map((l) => l.replace(/^- /, "")).join(" "),
     contextFields: extractTableFieldNames(contextTableLines),
killedBy: inbox enrichment: skill description and response fields in inbox entries includes skill_description and response_fields in inbox entries for existing skills
statusReason: [Then] the inbox entry includes skill_description -- expected 'boolean' to be 'string' // Object.is equality

[Killed] ArrowFunction
src/skill-loader.ts:265:35
 
   return {
     description: descriptionLines.join(" ") || title,
-    whenToUse: whenToUseLines.map((l) => l.replace(/^- /, "")).join(" "),
+    whenToUse: whenToUseLines.map(() => undefined).join(" "),
     contextFields: extractTableFieldNames(contextTableLines),
     responseFields: extractTableFieldNames(responseTableLines),
killedBy: skill-loader: Markdown table fallback (old-format SKILL.md) extracts when_to_use from ## When To Use section with dash prefix stripped
statusReason: expected [ ' ' ] to deeply equal [ 'First use case Second use case' ]

[Killed] StringLiteral
src/skill-loader.ts:265:59
 
   return {
     description: descriptionLines.join(" ") || title,
-    whenToUse: whenToUseLines.map((l) => l.replace(/^- /, "")).join(" "),
+    whenToUse: whenToUseLines.map((l) => l.replace(/^- /, "Stryker was here!")).join(" "),
     contextFields: extractTableFieldNames(contextTableLines),
     responseFields: extractTableFieldNames(responseTableLines),
killedBy: skill-loader: Markdown table fallback (old-format SKILL.md) extracts when_to_use from ## When To Use section with dash prefix stripped
statusReason: expected [ Array(1) ] to deeply equal [ 'First use case Second use case' ]

[Killed] BlockStatement
src/skill-loader.ts:275:65
  * Extract field names from Markdown table rows (first column).
  * Skips header and separator rows.
  */
-function extractTableFieldNames(tableLines: string[]): string[] {
-  const fields: string[] = [];
-  for (const line of tableLines) {
-    if (line.includes("---")) continue;
-    const cells = line
-      .split("|")
-      .map((c) => c.trim())
-      .filter((c) => c.length > 0);
-    if (cells.length === 0) continue;
-    const fieldName = cells[0].toLowerCase();
-    if (fieldName === "field") continue;
-    fields.push(fieldName);
-  }
-  return fields;
-}
+function extractTableFieldNames(tableLines: string[]): string[] {}
 
 // ---------------------------------------------------------------------------
killedBy: garp_discover: discover available request types and team lists all available skills with metadata when called with no query
statusReason: [When] Cory's agent calls garp_discover with no query -- Cannot read properties of undefined (reading 'length')

[Killed] BlockStatement
src/skill-loader.ts:277:34
  */
 function extractTableFieldNames(tableLines: string[]): string[] {
   const fields: string[] = [];
-  for (const line of tableLines) {
-    if (line.includes("---")) continue;
-    const cells = line
-      .split("|")
-      .map((c) => c.trim())
-      .filter((c) => c.length > 0);
-    if (cells.length === 0) continue;
-    const fieldName = cells[0].toLowerCase();
-    if (fieldName === "field") continue;
-    fields.push(fieldName);
-  }
+  for (const line of tableLines) {}
   return fields;
 }
killedBy: garp_discover: discover available request types and team lists all available skills with metadata when called with no query
statusReason: [Then] the result contains 4 skill entries sorted alphabetically by name -- expected [] to have a length of 4 but got +0

[Killed] ConditionalExpression
src/skill-loader.ts:278:9
 function extractTableFieldNames(tableLines: string[]): string[] {
   const fields: string[] = [];
   for (const line of tableLines) {
-    if (line.includes("---")) continue;
+    if (true) continue;
     const cells = line
       .split("|")
killedBy: garp_discover: discover available request types and team lists all available skills with metadata when called with no query
statusReason: [Then] the result contains 4 skill entries sorted alphabetically by name -- expected [] to have a length of 4 but got +0

[Killed] ConditionalExpression
src/skill-loader.ts:278:9
 function extractTableFieldNames(tableLines: string[]): string[] {
   const fields: string[] = [];
   for (const line of tableLines) {
-    if (line.includes("---")) continue;
+    if (false) continue;
     const cells = line
       .split("|")
killedBy: skill-loader: Markdown table fallback (old-format SKILL.md) skips header row where field name is 'field'
statusReason: expected [ '---', 'name' ] to deeply equal [ 'name' ]

[Killed] MethodExpression
src/skill-loader.ts:279:19
   const fields: string[] = [];
   for (const line of tableLines) {
     if (line.includes("---")) continue;
-    const cells = line
-      .split("|")
-      .map((c) => c.trim())
-      .filter((c) => c.length > 0);
+    const cells = line.split("|").map(c => c.trim());
     if (cells.length === 0) continue;
     const fieldName = cells[0].toLowerCase();
killedBy: skill-loader: Markdown table fallback (old-format SKILL.md) extracts fields from markdown tables with correct type:'string' and description:''
statusReason: expected undefined to deeply equal { type: 'string', description: '' }

[Killed] StringLiteral
src/skill-loader.ts:280:14
   for (const line of tableLines) {
     if (line.includes("---")) continue;
     const cells = line
-      .split("|")
+      .split("")
       .map((c) => c.trim())
       .filter((c) => c.length > 0);
killedBy: skill-loader: Markdown table fallback (old-format SKILL.md) extracts fields from markdown tables with correct type:'string' and description:''
statusReason: expected undefined to deeply equal { type: 'string', description: '' }

[Killed] ArrowFunction
src/skill-loader.ts:281:12
     if (line.includes("---")) continue;
     const cells = line
       .split("|")
-      .map((c) => c.trim())
+      .map(() => undefined)
       .filter((c) => c.length > 0);
     if (cells.length === 0) continue;
killedBy: skill-loader: Markdown table fallback (old-format SKILL.md) extracts fields from markdown tables with correct type:'string' and description:''
statusReason: Cannot read properties of undefined (reading 'length')

[Killed] MethodExpression
src/skill-loader.ts:281:19
     if (line.includes("---")) continue;
     const cells = line
       .split("|")
-      .map((c) => c.trim())
+      .map((c) => c)
       .filter((c) => c.length > 0);
     if (cells.length === 0) continue;
killedBy: skill-loader: Markdown table fallback (old-format SKILL.md) extracts fields from markdown tables with correct type:'string' and description:''
statusReason: expected undefined to deeply equal { type: 'string', description: '' }

[Killed] EqualityOperator
src/skill-loader.ts:282:22
     const cells = line
       .split("|")
       .map((c) => c.trim())
-      .filter((c) => c.length > 0);
+      .filter((c) => c.length <= 0);
     if (cells.length === 0) continue;
     const fieldName = cells[0].toLowerCase();
killedBy: skill-loader: Markdown table fallback (old-format SKILL.md) extracts fields from markdown tables with correct type:'string' and description:''
statusReason: expected undefined to deeply equal { type: 'string', description: '' }

[Killed] ArrowFunction
src/skill-loader.ts:282:15
     const cells = line
       .split("|")
       .map((c) => c.trim())
-      .filter((c) => c.length > 0);
+      .filter(() => undefined);
     if (cells.length === 0) continue;
     const fieldName = cells[0].toLowerCase();
killedBy: skill-loader: Markdown table fallback (old-format SKILL.md) extracts fields from markdown tables with correct type:'string' and description:''
statusReason: expected undefined to be defined

[Killed] EqualityOperator
src/skill-loader.ts:283:9
       .split("|")
       .map((c) => c.trim())
       .filter((c) => c.length > 0);
-    if (cells.length === 0) continue;
+    if (cells.length !== 0) continue;
     const fieldName = cells[0].toLowerCase();
     if (fieldName === "field") continue;
killedBy: skill-loader: Markdown table fallback (old-format SKILL.md) extracts fields from markdown tables with correct type:'string' and description:''
statusReason: expected undefined to be defined

[Killed] ConditionalExpression
src/skill-loader.ts:283:9
       .split("|")
       .map((c) => c.trim())
       .filter((c) => c.length > 0);
-    if (cells.length === 0) continue;
+    if (true) continue;
     const fieldName = cells[0].toLowerCase();
     if (fieldName === "field") continue;
killedBy: skill-loader: Markdown table fallback (old-format SKILL.md) extracts fields from markdown tables with correct type:'string' and description:''
statusReason: expected undefined to be defined

[Killed] MethodExpression
src/skill-loader.ts:284:23
       .map((c) => c.trim())
       .filter((c) => c.length > 0);
     if (cells.length === 0) continue;
-    const fieldName = cells[0].toLowerCase();
+    const fieldName = cells[0].toUpperCase();
     if (fieldName === "field") continue;
     fields.push(fieldName);
killedBy: skill-loader: Markdown table fallback (old-format SKILL.md) extracts fields from markdown tables with correct type:'string' and description:''
statusReason: expected undefined to deeply equal { type: 'string', description: '' }

[Killed] ConditionalExpression
src/skill-loader.ts:285:9
       .filter((c) => c.length > 0);
     if (cells.length === 0) continue;
     const fieldName = cells[0].toLowerCase();
-    if (fieldName === "field") continue;
+    if (true) continue;
     fields.push(fieldName);
   }
killedBy: skill-loader: Markdown table fallback (old-format SKILL.md) extracts fields from markdown tables with correct type:'string' and description:''
statusReason: expected undefined to be defined

[Killed] ConditionalExpression
src/skill-loader.ts:285:9
       .filter((c) => c.length > 0);
     if (cells.length === 0) continue;
     const fieldName = cells[0].toLowerCase();
-    if (fieldName === "field") continue;
+    if (false) continue;
     fields.push(fieldName);
   }
killedBy: skill-loader: Markdown table fallback (old-format SKILL.md) skips header row where field name is 'field'
statusReason: expected [ 'field', 'name' ] to deeply equal [ 'name' ]

[Killed] BlockStatement
src/skill-loader.ts:313:37
 async function readSchemaIfValid(
   file: FilePort,
   schemaPath: string,
-): Promise<SkillSchema | undefined> {
-  try {
-    const exists = await file.fileExists(schemaPath);
-    if (!exists) return undefined;
-    const raw = await file.readJSON<Record<string, unknown>>(schemaPath);
-    const contextBundle = raw.context_bundle as SchemaBundle | undefined;
-    const responseBundle = raw.response_bundle as SchemaBundle | undefined;
-    const hasContextProps =
-      contextBundle?.properties && typeof contextBundle.properties === "object";
-    const hasResponseProps =
-      responseBundle?.properties && typeof responseBundle.properties === "object";
-    if (!hasContextProps && !hasResponseProps) return undefined;
-    return { context_bundle: contextBundle, response_bundle: responseBundle };
-  } catch {
-    return undefined;
-  }
-}
+): Promise<SkillSchema | undefined> {}
 
 /**
killedBy: skill-loader: schema.json fallback for old-format SKILL.md uses schema.json when present alongside old-format SKILL.md
statusReason: expected [] to deeply equal [ 'question' ]

[Killed] BlockStatement
src/skill-loader.ts:314:7
   file: FilePort,
   schemaPath: string,
 ): Promise<SkillSchema | undefined> {
-  try {
-    const exists = await file.fileExists(schemaPath);
-    if (!exists) return undefined;
-    const raw = await file.readJSON<Record<string, unknown>>(schemaPath);
-    const contextBundle = raw.context_bundle as SchemaBundle | undefined;
-    const responseBundle = raw.response_bundle as SchemaBundle | undefined;
-    const hasContextProps =
-      contextBundle?.properties && typeof contextBundle.properties === "object";
-    const hasResponseProps =
-      responseBundle?.properties && typeof responseBundle.properties === "object";
-    if (!hasContextProps && !hasResponseProps) return undefined;
-    return { context_bundle: contextBundle, response_bundle: responseBundle };
-  } catch {
+  try {} catch {
     return undefined;
   }
killedBy: skill-loader: schema.json fallback for old-format SKILL.md uses schema.json when present alongside old-format SKILL.md
statusReason: expected [] to deeply equal [ 'question' ]

[Killed] BooleanLiteral
src/skill-loader.ts:316:9
 ): Promise<SkillSchema | undefined> {
   try {
     const exists = await file.fileExists(schemaPath);
-    if (!exists) return undefined;
+    if (exists) return undefined;
     const raw = await file.readJSON<Record<string, unknown>>(schemaPath);
     const contextBundle = raw.context_bundle as SchemaBundle | undefined;
killedBy: skill-loader: schema.json fallback for old-format SKILL.md uses schema.json when present alongside old-format SKILL.md
statusReason: expected [] to deeply equal [ 'question' ]

[Killed] ConditionalExpression
src/skill-loader.ts:316:9
 ): Promise<SkillSchema | undefined> {
   try {
     const exists = await file.fileExists(schemaPath);
-    if (!exists) return undefined;
+    if (true) return undefined;
     const raw = await file.readJSON<Record<string, unknown>>(schemaPath);
     const contextBundle = raw.context_bundle as SchemaBundle | undefined;
killedBy: skill-loader: schema.json fallback for old-format SKILL.md uses schema.json when present alongside old-format SKILL.md
statusReason: expected [] to deeply equal [ 'question' ]

[Killed] EqualityOperator
src/skill-loader.ts:321:36
     const contextBundle = raw.context_bundle as SchemaBundle | undefined;
     const responseBundle = raw.response_bundle as SchemaBundle | undefined;
     const hasContextProps =
-      contextBundle?.properties && typeof contextBundle.properties === "object";
+      contextBundle?.properties && typeof contextBundle.properties !== "object";
     const hasResponseProps =
       responseBundle?.properties && typeof responseBundle.properties === "object";
killedBy: skill-loader: schema.json fallback for old-format SKILL.md handles schemaBundleToBundleSpec with undefined bundle
statusReason: expected [] to deeply equal [ 'f1' ]

[Killed] ConditionalExpression
src/skill-loader.ts:321:7
     const contextBundle = raw.context_bundle as SchemaBundle | undefined;
     const responseBundle = raw.response_bundle as SchemaBundle | undefined;
     const hasContextProps =
-      contextBundle?.properties && typeof contextBundle.properties === "object";
+      true;
     const hasResponseProps =
       responseBundle?.properties && typeof responseBundle.properties === "object";
killedBy: skill-loader: schema.json fallback for old-format SKILL.md returns undefined for schema.json without context or response properties
statusReason: expected undefined to deeply equal { type: 'string', description: '' }

[Killed] OptionalChaining
src/skill-loader.ts:323:7
     const hasContextProps =
       contextBundle?.properties && typeof contextBundle.properties === "object";
     const hasResponseProps =
-      responseBundle?.properties && typeof responseBundle.properties === "object";
+      responseBundle.properties && typeof responseBundle.properties === "object";
     if (!hasContextProps && !hasResponseProps) return undefined;
     return { context_bundle: contextBundle, response_bundle: responseBundle };
killedBy: skill-loader: schema.json fallback for old-format SKILL.md handles schemaBundleToBundleSpec with undefined bundle
statusReason: expected [] to deeply equal [ 'f1' ]

[Killed] LogicalOperator
src/skill-loader.ts:323:7
     const hasContextProps =
       contextBundle?.properties && typeof contextBundle.properties === "object";
     const hasResponseProps =
-      responseBundle?.properties && typeof responseBundle.properties === "object";
+      responseBundle?.properties || typeof responseBundle.properties === "object";
     if (!hasContextProps && !hasResponseProps) return undefined;
     return { context_bundle: contextBundle, response_bundle: responseBundle };
killedBy: skill-loader: schema.json fallback for old-format SKILL.md handles schemaBundleToBundleSpec with undefined bundle
statusReason: expected [] to deeply equal [ 'f1' ]
