[Killed] ConditionalExpression
src/skill-loader.ts:324:9
       contextBundle?.properties && typeof contextBundle.properties === "object";
     const hasResponseProps =
       responseBundle?.properties && typeof responseBundle.properties === "object";
-    if (!hasContextProps && !hasResponseProps) return undefined;
+    if (true) return undefined;
     return { context_bundle: contextBundle, response_bundle: responseBundle };
   } catch {
killedBy: garp_discover: discover available request types and team prefers schema.json for field extraction when schema.json exists
statusReason: [Then] the sanity-check entry has required fields from schema.json -- expected [] to deeply equal ArrayContaining{…}

[Killed] ConditionalExpression
src/skill-loader.ts:324:9
       contextBundle?.properties && typeof contextBundle.properties === "object";
     const hasResponseProps =
       responseBundle?.properties && typeof responseBundle.properties === "object";
-    if (!hasContextProps && !hasResponseProps) return undefined;
+    if (false) return undefined;
     return { context_bundle: contextBundle, response_bundle: responseBundle };
   } catch {
killedBy: skill-loader: schema.json fallback for old-format SKILL.md returns undefined for schema.json without context or response properties
statusReason: expected undefined to deeply equal { type: 'string', description: '' }

[NoCoverage] BlockStatement
src/skill-loader.ts:326:11
       responseBundle?.properties && typeof responseBundle.properties === "object";
     if (!hasContextProps && !hasResponseProps) return undefined;
     return { context_bundle: contextBundle, response_bundle: responseBundle };
-  } catch {
-    return undefined;
-  }
+  } catch {}
 }
 

[Killed] BlockStatement
src/skill-loader.ts:334:81
 /**
  * Convert a JSON Schema bundle (from schema.json) to a BundleSpec.
  */
-function schemaBundleToBundleSpec(bundle: SchemaBundle | undefined): BundleSpec {
-  if (!bundle) return { required: [], fields: {} };
-  const required = Array.isArray(bundle.required) ? bundle.required : [];
-  const fields: Record<string, BundleFieldDef> = {};
-  if (bundle.properties && typeof bundle.properties === "object") {
-    for (const [key, value] of Object.entries(bundle.properties)) {
-      if (value && typeof value === "object") {
-        const prop = value as Record<string, unknown>;
-        fields[key] = {
-          type: typeof prop.type === "string" ? prop.type : "string",
-          description: typeof prop.description === "string" ? prop.description : "",
-        };
-      }
-    }
-  }
-  return { required, fields };
-}
+function schemaBundleToBundleSpec(bundle: SchemaBundle | undefined): BundleSpec {}
 
 /**
killedBy: skill-loader: schema.json fallback for old-format SKILL.md uses schema.json when present alongside old-format SKILL.md
statusReason: Cannot read properties of undefined (reading 'required')

[Killed] BooleanLiteral
src/skill-loader.ts:335:7
  * Convert a JSON Schema bundle (from schema.json) to a BundleSpec.
  */
 function schemaBundleToBundleSpec(bundle: SchemaBundle | undefined): BundleSpec {
-  if (!bundle) return { required: [], fields: {} };
+  if (bundle) return { required: [], fields: {} };
   const required = Array.isArray(bundle.required) ? bundle.required : [];
   const fields: Record<string, BundleFieldDef> = {};
killedBy: skill-loader: schema.json fallback for old-format SKILL.md uses schema.json when present alongside old-format SKILL.md
statusReason: expected [] to deeply equal [ 'question' ]

[Killed] ConditionalExpression
src/skill-loader.ts:335:7
  * Convert a JSON Schema bundle (from schema.json) to a BundleSpec.
  */
 function schemaBundleToBundleSpec(bundle: SchemaBundle | undefined): BundleSpec {
-  if (!bundle) return { required: [], fields: {} };
+  if (false) return { required: [], fields: {} };
   const required = Array.isArray(bundle.required) ? bundle.required : [];
   const fields: Record<string, BundleFieldDef> = {};
killedBy: skill-loader: schema.json fallback for old-format SKILL.md handles schemaBundleToBundleSpec with undefined bundle
statusReason: Cannot read properties of undefined (reading 'required')

[Killed] ConditionalExpression
src/skill-loader.ts:338:7
   if (!bundle) return { required: [], fields: {} };
   const required = Array.isArray(bundle.required) ? bundle.required : [];
   const fields: Record<string, BundleFieldDef> = {};
-  if (bundle.properties && typeof bundle.properties === "object") {
+  if (false) {
     for (const [key, value] of Object.entries(bundle.properties)) {
       if (value && typeof value === "object") {
killedBy: skill-loader: schema.json fallback for old-format SKILL.md uses schema.json when present alongside old-format SKILL.md
statusReason: expected undefined to deeply equal { type: 'string', …(1) }

[Killed] BlockStatement
src/skill-loader.ts:338:67
   if (!bundle) return { required: [], fields: {} };
   const required = Array.isArray(bundle.required) ? bundle.required : [];
   const fields: Record<string, BundleFieldDef> = {};
-  if (bundle.properties && typeof bundle.properties === "object") {
-    for (const [key, value] of Object.entries(bundle.properties)) {
-      if (value && typeof value === "object") {
-        const prop = value as Record<string, unknown>;
-        fields[key] = {
-          type: typeof prop.type === "string" ? prop.type : "string",
-          description: typeof prop.description === "string" ? prop.description : "",
-        };
-      }
-    }
-  }
+  if (bundle.properties && typeof bundle.properties === "object") {}
   return { required, fields };
 }
killedBy: skill-loader: schema.json fallback for old-format SKILL.md uses schema.json when present alongside old-format SKILL.md
statusReason: expected undefined to deeply equal { type: 'string', …(1) }

[Killed] BlockStatement
src/skill-loader.ts:339:67
   const required = Array.isArray(bundle.required) ? bundle.required : [];
   const fields: Record<string, BundleFieldDef> = {};
   if (bundle.properties && typeof bundle.properties === "object") {
-    for (const [key, value] of Object.entries(bundle.properties)) {
-      if (value && typeof value === "object") {
-        const prop = value as Record<string, unknown>;
-        fields[key] = {
-          type: typeof prop.type === "string" ? prop.type : "string",
-          description: typeof prop.description === "string" ? prop.description : "",
-        };
-      }
-    }
+    for (const [key, value] of Object.entries(bundle.properties)) {}
   }
   return { required, fields };
killedBy: skill-loader: schema.json fallback for old-format SKILL.md uses schema.json when present alongside old-format SKILL.md
statusReason: expected undefined to deeply equal { type: 'string', …(1) }

[Killed] ConditionalExpression
src/skill-loader.ts:340:11
   const fields: Record<string, BundleFieldDef> = {};
   if (bundle.properties && typeof bundle.properties === "object") {
     for (const [key, value] of Object.entries(bundle.properties)) {
-      if (value && typeof value === "object") {
+      if (true) {
         const prop = value as Record<string, unknown>;
         fields[key] = {
killedBy: skill-loader: schema.json fallback for old-format SKILL.md handles schema.json property values that are not objects
statusReason: Cannot read properties of null (reading 'type')

[Killed] BlockStatement
src/skill-loader.ts:340:47
   const fields: Record<string, BundleFieldDef> = {};
   if (bundle.properties && typeof bundle.properties === "object") {
     for (const [key, value] of Object.entries(bundle.properties)) {
-      if (value && typeof value === "object") {
-        const prop = value as Record<string, unknown>;
-        fields[key] = {
-          type: typeof prop.type === "string" ? prop.type : "string",
-          description: typeof prop.description === "string" ? prop.description : "",
-        };
-      }
+      if (value && typeof value === "object") {}
     }
   }
killedBy: inbox enrichment: skill description and response fields in inbox entries extracts response_fields from schema.json when available
statusReason: [Then] response_fields are extracted from schema.json response_bundle properties -- expected [] to deeply equal ArrayContaining{…}

[Killed] ObjectLiteral
src/skill-loader.ts:342:23
     for (const [key, value] of Object.entries(bundle.properties)) {
       if (value && typeof value === "object") {
         const prop = value as Record<string, unknown>;
-        fields[key] = {
-          type: typeof prop.type === "string" ? prop.type : "string",
-          description: typeof prop.description === "string" ? prop.description : "",
-        };
+        fields[key] = {};
       }
     }
killedBy: skill-loader: schema.json fallback for old-format SKILL.md uses schema.json when present alongside old-format SKILL.md
statusReason: expected {} to deeply equal { type: 'string', …(1) }

[Killed] ConditionalExpression
src/skill-loader.ts:343:17
       if (value && typeof value === "object") {
         const prop = value as Record<string, unknown>;
         fields[key] = {
-          type: typeof prop.type === "string" ? prop.type : "string",
+          type: false ? prop.type : "string",
           description: typeof prop.description === "string" ? prop.description : "",
         };
killedBy: skill-loader: schema.json fallback for old-format SKILL.md uses schema.json when present alongside old-format SKILL.md
statusReason: expected { type: 'string', …(1) } to deeply equal { type: 'integer', …(1) }

[Killed] EqualityOperator
src/skill-loader.ts:343:17
       if (value && typeof value === "object") {
         const prop = value as Record<string, unknown>;
         fields[key] = {
-          type: typeof prop.type === "string" ? prop.type : "string",
+          type: typeof prop.type !== "string" ? prop.type : "string",
           description: typeof prop.description === "string" ? prop.description : "",
         };
killedBy: skill-loader: schema.json fallback for old-format SKILL.md uses schema.json when present alongside old-format SKILL.md
statusReason: expected { type: 'string', …(1) } to deeply equal { type: 'integer', …(1) }

[Killed] ConditionalExpression
src/skill-loader.ts:344:24
         const prop = value as Record<string, unknown>;
         fields[key] = {
           type: typeof prop.type === "string" ? prop.type : "string",
-          description: typeof prop.description === "string" ? prop.description : "",
+          description: true ? prop.description : "",
         };
       }
killedBy: skill-loader: schema.json fallback for old-format SKILL.md handles schema.json properties with non-string type/description
statusReason: expected true to be '' // Object.is equality

[Killed] ConditionalExpression
src/skill-loader.ts:344:24
         const prop = value as Record<string, unknown>;
         fields[key] = {
           type: typeof prop.type === "string" ? prop.type : "string",
-          description: typeof prop.description === "string" ? prop.description : "",
+          description: false ? prop.description : "",
         };
       }
killedBy: skill-loader: schema.json fallback for old-format SKILL.md uses schema.json when present alongside old-format SKILL.md
statusReason: expected { type: 'string', description: '' } to deeply equal { type: 'string', …(1) }

[Killed] ObjectLiteral
src/skill-loader.ts:349:10
       }
     }
   }
-  return { required, fields };
+  return {};
 }
 
killedBy: skill-loader: schema.json fallback for old-format SKILL.md uses schema.json when present alongside old-format SKILL.md
statusReason: expected undefined to deeply equal [ 'question' ]

[Killed] BlockStatement
src/skill-loader.ts:355:66
 /**
  * Convert a flat list of field names (from Markdown tables) to a BundleSpec.
  */
-function fieldListToBundleSpec(fieldNames: string[]): BundleSpec {
-  const fields: Record<string, BundleFieldDef> = {};
-  for (const name of fieldNames) {
-    fields[name] = { type: "string", description: "" };
-  }
-  return { required: [], fields };
-}
+function fieldListToBundleSpec(fieldNames: string[]): BundleSpec {}
 
 // ---------------------------------------------------------------------------
killedBy: skill-loader: Markdown table fallback (old-format SKILL.md) extracts fields from markdown tables with correct type:'string' and description:''
statusReason: Cannot read properties of undefined (reading 'fields')

[Killed] BlockStatement
src/skill-loader.ts:357:34
  */
 function fieldListToBundleSpec(fieldNames: string[]): BundleSpec {
   const fields: Record<string, BundleFieldDef> = {};
-  for (const name of fieldNames) {
-    fields[name] = { type: "string", description: "" };
-  }
+  for (const name of fieldNames) {}
   return { required: [], fields };
 }
killedBy: skill-loader: Markdown table fallback (old-format SKILL.md) extracts fields from markdown tables with correct type:'string' and description:''
statusReason: expected undefined to deeply equal { type: 'string', description: '' }

[Killed] StringLiteral
src/skill-loader.ts:358:28
 function fieldListToBundleSpec(fieldNames: string[]): BundleSpec {
   const fields: Record<string, BundleFieldDef> = {};
   for (const name of fieldNames) {
-    fields[name] = { type: "string", description: "" };
+    fields[name] = { type: "", description: "" };
   }
   return { required: [], fields };
killedBy: skill-loader: Markdown table fallback (old-format SKILL.md) extracts fields from markdown tables with correct type:'string' and description:''
statusReason: expected { type: '', description: '' } to deeply equal { type: 'string', description: '' }

[Killed] LogicalOperator
src/skill-loader.ts:371:7
  * Parse a context_bundle or response_bundle section from the YAML.
  */
 function parseBundleSpec(raw: unknown): BundleSpec {
-  if (!raw || typeof raw !== "object") {
+  if (!raw && typeof raw !== "object") {
     return { required: [], fields: {} };
   }
killedBy: skill-loader: parseBundleSpec with non-object inputs returns empty BundleSpec when context_bundle is null
statusReason: Cannot read properties of null (reading 'required')

[Killed] ConditionalExpression
src/skill-loader.ts:371:7
  * Parse a context_bundle or response_bundle section from the YAML.
  */
 function parseBundleSpec(raw: unknown): BundleSpec {
-  if (!raw || typeof raw !== "object") {
+  if (true) {
     return { required: [], fields: {} };
   }
killedBy: skill-loader: valid YAML frontmatter extracts context_bundle fields and required list
statusReason: expected [] to deeply equal [ 'question' ]

[Killed] MethodExpression
src/skill-loader.ts:377:7
 
   const obj = raw as Record<string, unknown>;
   const required = Array.isArray(obj.required)
-    ? obj.required.filter((r): r is string => typeof r === "string")
+    ? obj.required
     : [];
 
killedBy: skill-loader: required array filters non-strings filters non-string items from required array
statusReason: expected [ 'question', 123, true, 'answer' ] to deeply equal [ 'question', 'answer' ]

[Killed] EqualityOperator
src/skill-loader.ts:377:47
 
   const obj = raw as Record<string, unknown>;
   const required = Array.isArray(obj.required)
-    ? obj.required.filter((r): r is string => typeof r === "string")
+    ? obj.required.filter((r): r is string => typeof r !== "string")
     : [];
 
killedBy: skill-loader: valid YAML frontmatter extracts context_bundle fields and required list
statusReason: expected [] to deeply equal [ 'question' ]

[Killed] ConditionalExpression
src/skill-loader.ts:381:7
     : [];
 
   const fields: Record<string, BundleFieldDef> = {};
-  if (obj.fields && typeof obj.fields === "object") {
+  if (false) {
     const rawFields = obj.fields as Record<string, unknown>;
     for (const [key, value] of Object.entries(rawFields)) {
killedBy: skill-loader: valid YAML frontmatter extracts context_bundle fields and required list
statusReason: expected [] to deeply equal [ 'question', 'background', …(2) ]

[Killed] BlockStatement
src/skill-loader.ts:381:53
     : [];
 
   const fields: Record<string, BundleFieldDef> = {};
-  if (obj.fields && typeof obj.fields === "object") {
-    const rawFields = obj.fields as Record<string, unknown>;
-    for (const [key, value] of Object.entries(rawFields)) {
-      if (value && typeof value === "object") {
-        const fieldObj = value as Record<string, unknown>;
-        fields[key] = {
-          type: typeof fieldObj.type === "string" ? fieldObj.type : "string",
-          description:
-            typeof fieldObj.description === "string"
-              ? fieldObj.description
-              : "",
-        };
-      }
-    }
-  }
+  if (obj.fields && typeof obj.fields === "object") {}
 
   return { required, fields };
killedBy: garp_discover: discover available request types and team discovers available request types and team members from YAML skill contracts
statusReason: [Then] each skill has context_bundle with required fields and field definitions -- expected undefined to deeply equal { type: 'string', …(1) }

[Killed] BlockStatement
src/skill-loader.ts:383:59
   const fields: Record<string, BundleFieldDef> = {};
   if (obj.fields && typeof obj.fields === "object") {
     const rawFields = obj.fields as Record<string, unknown>;
-    for (const [key, value] of Object.entries(rawFields)) {
-      if (value && typeof value === "object") {
-        const fieldObj = value as Record<string, unknown>;
-        fields[key] = {
-          type: typeof fieldObj.type === "string" ? fieldObj.type : "string",
-          description:
-            typeof fieldObj.description === "string"
-              ? fieldObj.description
-              : "",
-        };
-      }
-    }
+    for (const [key, value] of Object.entries(rawFields)) {}
   }
 
killedBy: garp_discover: discover available request types and team discovers available request types and team members from YAML skill contracts
statusReason: [Then] each skill has context_bundle with required fields and field definitions -- expected undefined to deeply equal { type: 'string', …(1) }

[Killed] ConditionalExpression
src/skill-loader.ts:384:11
   if (obj.fields && typeof obj.fields === "object") {
     const rawFields = obj.fields as Record<string, unknown>;
     for (const [key, value] of Object.entries(rawFields)) {
-      if (value && typeof value === "object") {
+      if (false) {
         const fieldObj = value as Record<string, unknown>;
         fields[key] = {
killedBy: garp_discover: discover available request types and team discovers available request types and team members from YAML skill contracts
statusReason: [Then] each skill has context_bundle with required fields and field definitions -- expected undefined to deeply equal { type: 'string', …(1) }

[Killed] EqualityOperator
src/skill-loader.ts:384:20
   if (obj.fields && typeof obj.fields === "object") {
     const rawFields = obj.fields as Record<string, unknown>;
     for (const [key, value] of Object.entries(rawFields)) {
-      if (value && typeof value === "object") {
+      if (value && typeof value !== "object") {
         const fieldObj = value as Record<string, unknown>;
         fields[key] = {
killedBy: garp_discover: discover available request types and team discovers available request types and team members from YAML skill contracts
statusReason: [Then] each skill has context_bundle with required fields and field definitions -- expected undefined to deeply equal { type: 'string', …(1) }

[Killed] ConditionalExpression
src/skill-loader.ts:387:17
       if (value && typeof value === "object") {
         const fieldObj = value as Record<string, unknown>;
         fields[key] = {
-          type: typeof fieldObj.type === "string" ? fieldObj.type : "string",
+          type: true ? fieldObj.type : "string",
           description:
             typeof fieldObj.description === "string"
killedBy: skill-loader: parseBundleSpec with malformed fields defaults field type to 'string' when type is non-string
statusReason: expected 123 to be 'string' // Object.is equality

[Killed] EqualityOperator
src/skill-loader.ts:387:17
       if (value && typeof value === "object") {
         const fieldObj = value as Record<string, unknown>;
         fields[key] = {
-          type: typeof fieldObj.type === "string" ? fieldObj.type : "string",
+          type: typeof fieldObj.type !== "string" ? fieldObj.type : "string",
           description:
             typeof fieldObj.description === "string"
killedBy: skill-loader: parseBundleSpec with malformed fields defaults field type to 'string' when type is non-string
statusReason: expected 123 to be 'string' // Object.is equality

[Killed] ConditionalExpression
src/skill-loader.ts:389:13
         fields[key] = {
           type: typeof fieldObj.type === "string" ? fieldObj.type : "string",
           description:
-            typeof fieldObj.description === "string"
+            true
               ? fieldObj.description
               : "",
killedBy: skill-loader: parseBundleSpec with malformed fields defaults field description to '' when description is non-string
statusReason: expected 999 to be '' // Object.is equality

[Killed] ConditionalExpression
src/skill-loader.ts:389:13
         fields[key] = {
           type: typeof fieldObj.type === "string" ? fieldObj.type : "string",
           description:
-            typeof fieldObj.description === "string"
+            false
               ? fieldObj.description
               : "",
killedBy: skill-loader: valid YAML frontmatter extracts context_bundle fields and required list
statusReason: expected { type: 'string', description: '' } to deeply equal { type: 'string', …(1) }
