[Killed] BlockStatement
src/tools/garp-discover.ts:71:7
 
   // 2. List skills directory
   let skillDirs: string[];
-  try {
-    skillDirs = await ctx.file.listDirectory("skills");
-  } catch {
+  try {} catch {
     log("warn", "garp_discover: skills directory not found");
     const team = await readTeam(ctx);
killedBy: garp_discover: discover available request types and team discovers available request types and team members from YAML skill contracts
statusReason: [When] an agent calls garp_discover -- skillDirs is not iterable

[Killed] StringLiteral
src/tools/garp-discover.ts:72:46
   // 2. List skills directory
   let skillDirs: string[];
   try {
-    skillDirs = await ctx.file.listDirectory("skills");
+    skillDirs = await ctx.file.listDirectory("");
   } catch {
     log("warn", "garp_discover: skills directory not found");
killedBy: garp_discover: discover available request types and team discovers available request types and team members from YAML skill contracts
statusReason: [Then] the catalog includes all installed skills sorted by name -- expected [] to have a length of 3 but got +0

[NoCoverage] BlockStatement
src/tools/garp-discover.ts:73:11
   let skillDirs: string[];
   try {
     skillDirs = await ctx.file.listDirectory("skills");
-  } catch {
-    log("warn", "garp_discover: skills directory not found");
-    const team = await readTeam(ctx);
-    return { skills: [], team, ...(warning ? { warning } : {}) };
-  }
+  } catch {}
 
   // 3. Load metadata for each skill directory

[NoCoverage] StringLiteral
src/tools/garp-discover.ts:74:9
   try {
     skillDirs = await ctx.file.listDirectory("skills");
   } catch {
-    log("warn", "garp_discover: skills directory not found");
+    log("", "garp_discover: skills directory not found");
     const team = await readTeam(ctx);
     return { skills: [], team, ...(warning ? { warning } : {}) };

[NoCoverage] StringLiteral
src/tools/garp-discover.ts:74:17
   try {
     skillDirs = await ctx.file.listDirectory("skills");
   } catch {
-    log("warn", "garp_discover: skills directory not found");
+    log("warn", "");
     const team = await readTeam(ctx);
     return { skills: [], team, ...(warning ? { warning } : {}) };

[NoCoverage] ObjectLiteral
src/tools/garp-discover.ts:76:46
   } catch {
     log("warn", "garp_discover: skills directory not found");
     const team = await readTeam(ctx);
-    return { skills: [], team, ...(warning ? { warning } : {}) };
+    return { skills: [], team, ...(warning ? {} : {}) };
   }
 

[NoCoverage] ArrayDeclaration
src/tools/garp-discover.ts:76:22
   } catch {
     log("warn", "garp_discover: skills directory not found");
     const team = await readTeam(ctx);
-    return { skills: [], team, ...(warning ? { warning } : {}) };
+    return { skills: ["Stryker was here"], team, ...(warning ? { warning } : {}) };
   }
 

[Killed] ArrayDeclaration
src/tools/garp-discover.ts:80:39
   }
 
   // 3. Load metadata for each skill directory
-  const skills: SkillCatalogEntry[] = [];
+  const skills: SkillCatalogEntry[] = ["Stryker was here"];
   for (const dirName of skillDirs) {
     // Skip hidden directories (e.g. .gitkeep)
killedBy: garp_discover: discover available request types and team discovers available request types and team members from YAML skill contracts
statusReason: [Then] the catalog includes all installed skills sorted by name -- expected [ { name: 'ask', …(5) }, …(3) ] to have a length of 3 but got 4

[Killed] BlockStatement
src/tools/garp-discover.ts:81:36
 
   // 3. Load metadata for each skill directory
   const skills: SkillCatalogEntry[] = [];
-  for (const dirName of skillDirs) {
-    // Skip hidden directories (e.g. .gitkeep)
-    if (dirName.startsWith(".")) {
-      continue;
-    }
-
-    const metadata = await loadSkillMetadata(ctx.file, dirName);
-    if (!metadata) {
-      continue;
-    }
-
-    skills.push(toEntry(metadata));
-  }
+  for (const dirName of skillDirs) {}
 
   // 4. Filter by query if provided
killedBy: garp_discover: discover available request types and team discovers available request types and team members from YAML skill contracts
statusReason: [Then] the catalog includes all installed skills sorted by name -- expected [] to have a length of 3 but got +0

[Killed] ConditionalExpression
src/tools/garp-discover.ts:83:9
   const skills: SkillCatalogEntry[] = [];
   for (const dirName of skillDirs) {
     // Skip hidden directories (e.g. .gitkeep)
-    if (dirName.startsWith(".")) {
+    if (false) {
       continue;
     }
killedBy: garp_discover: discover available request types and team excludes hidden directories from skill listing
statusReason: [Then] the hidden directory is excluded from results -- expected [ { name: 'ask', …(5) }, …(2) ] to have a length of 2 but got 3

[Killed] MethodExpression
src/tools/garp-discover.ts:83:9
   const skills: SkillCatalogEntry[] = [];
   for (const dirName of skillDirs) {
     // Skip hidden directories (e.g. .gitkeep)
-    if (dirName.startsWith(".")) {
+    if (dirName.endsWith(".")) {
       continue;
     }
killedBy: garp_discover: discover available request types and team excludes hidden directories from skill listing
statusReason: [Then] the hidden directory is excluded from results -- expected [ { name: 'ask', …(5) }, …(2) ] to have a length of 2 but got 3

[Killed] ConditionalExpression
src/tools/garp-discover.ts:88:9
     }
 
     const metadata = await loadSkillMetadata(ctx.file, dirName);
-    if (!metadata) {
+    if (false) {
       continue;
     }
killedBy: garp_discover: discover available request types and team skips skill directories that have no SKILL.md
statusReason: [When] an agent calls garp_discover -- Cannot read properties of undefined (reading 'name')

[Killed] BlockStatement
src/tools/garp-discover.ts:88:20
     }
 
     const metadata = await loadSkillMetadata(ctx.file, dirName);
-    if (!metadata) {
-      continue;
-    }
+    if (!metadata) {}
 
     skills.push(toEntry(metadata));
killedBy: garp_discover: discover available request types and team skips skill directories that have no SKILL.md
statusReason: [When] an agent calls garp_discover -- Cannot read properties of undefined (reading 'name')

[Killed] BlockStatement
src/tools/garp-discover.ts:97:21
 
   // 4. Filter by query if provided
   let filtered = skills;
-  if (params.query) {
-    const terms = params.query.toLowerCase().split(/\s+/);
-    filtered = skills.filter((skill) => {
-      const searchText = [
-        skill.name,
-        skill.description,
-        ...skill.when_to_use,
-      ].join(" ").toLowerCase();
-      return terms.some((term) => searchText.includes(term));
-    });
-  }
+  if (params.query) {}
 
   // 5. Sort by name for consistent ordering
killedBy: garp_discover: discover available request types and team filters skills by keyword matching against name, description, and when_to_use
statusReason: [Then] the result excludes unrelated skills -- expected [ Array(3) ] to not include 'ask'

[Killed] ConditionalExpression
src/tools/garp-discover.ts:97:7
 
   // 4. Filter by query if provided
   let filtered = skills;
-  if (params.query) {
+  if (true) {
     const terms = params.query.toLowerCase().split(/\s+/);
     filtered = skills.filter((skill) => {
killedBy: garp_discover: discover available request types and team discovers available request types and team members from YAML skill contracts
statusReason: [When] an agent calls garp_discover -- Cannot read properties of undefined (reading 'toLowerCase')

[Killed] MethodExpression
src/tools/garp-discover.ts:98:19
   // 4. Filter by query if provided
   let filtered = skills;
   if (params.query) {
-    const terms = params.query.toLowerCase().split(/\s+/);
+    const terms = params.query.toUpperCase().split(/\s+/);
     filtered = skills.filter((skill) => {
       const searchText = [
killedBy: garp_discover: discover available request types and team filters skills by keyword matching against name, description, and when_to_use
statusReason: [Then] the result includes the code-review skill -- expected [] to include 'code-review'

[Killed] BlockStatement
src/tools/garp-discover.ts:99:41
   let filtered = skills;
   if (params.query) {
     const terms = params.query.toLowerCase().split(/\s+/);
-    filtered = skills.filter((skill) => {
-      const searchText = [
-        skill.name,
-        skill.description,
-        ...skill.when_to_use,
-      ].join(" ").toLowerCase();
-      return terms.some((term) => searchText.includes(term));
-    });
+    filtered = skills.filter((skill) => {});
   }
 
killedBy: garp_discover: discover available request types and team filters skills by keyword matching against name, description, and when_to_use
statusReason: [Then] the result includes the code-review skill -- expected [] to include 'code-review'

[Killed] MethodExpression
src/tools/garp-discover.ts:99:16
   let filtered = skills;
   if (params.query) {
     const terms = params.query.toLowerCase().split(/\s+/);
-    filtered = skills.filter((skill) => {
-      const searchText = [
-        skill.name,
-        skill.description,
-        ...skill.when_to_use,
-      ].join(" ").toLowerCase();
-      return terms.some((term) => searchText.includes(term));
-    });
+    filtered = skills;
   }
 
killedBy: garp_discover: discover available request types and team filters skills by keyword matching against name, description, and when_to_use
statusReason: [Then] the result excludes unrelated skills -- expected [ Array(3) ] to not include 'ask'

[Killed] MethodExpression
src/tools/garp-discover.ts:100:26
   if (params.query) {
     const terms = params.query.toLowerCase().split(/\s+/);
     filtered = skills.filter((skill) => {
-      const searchText = [
-        skill.name,
-        skill.description,
-        ...skill.when_to_use,
-      ].join(" ").toLowerCase();
+      const searchText = [skill.name, skill.description, ...skill.when_to_use].join(" ").toUpperCase();
       return terms.some((term) => searchText.includes(term));
     });
killedBy: garp_discover: discover available request types and team filters skills by keyword matching against name, description, and when_to_use
statusReason: [Then] the result includes the code-review skill -- expected [] to include 'code-review'

[Killed] ArrayDeclaration
src/tools/garp-discover.ts:100:26
   if (params.query) {
     const terms = params.query.toLowerCase().split(/\s+/);
     filtered = skills.filter((skill) => {
-      const searchText = [
-        skill.name,
-        skill.description,
-        ...skill.when_to_use,
-      ].join(" ").toLowerCase();
+      const searchText = [].join(" ").toLowerCase();
       return terms.some((term) => searchText.includes(term));
     });
killedBy: garp_discover: discover available request types and team filters skills by keyword matching against name, description, and when_to_use
statusReason: [Then] the result includes the code-review skill -- expected [] to include 'code-review'

[Killed] ArrowFunction
src/tools/garp-discover.ts:105:25
         skill.description,
         ...skill.when_to_use,
       ].join(" ").toLowerCase();
-      return terms.some((term) => searchText.includes(term));
+      return terms.some(() => undefined);
     });
   }
killedBy: garp_discover: discover available request types and team filters skills by keyword matching against name, description, and when_to_use
statusReason: [Then] the result includes the code-review skill -- expected [] to include 'code-review'

[Killed] MethodExpression
src/tools/garp-discover.ts:105:14
         skill.description,
         ...skill.when_to_use,
       ].join(" ").toLowerCase();
-      return terms.some((term) => searchText.includes(term));
+      return terms.every(term => searchText.includes(term));
     });
   }
killedBy: garp_discover: discover available request types and team matches when any search term hits (OR semantics, not AND)
statusReason: [Then] the sanity-check skill is included (any term match = included) -- expected [] to include 'sanity-check'

[Survived] MethodExpression
src/tools/garp-discover.ts:110:3
   }
 
   // 5. Sort by name for consistent ordering
-  filtered.sort((a, b) => a.name.localeCompare(b.name));
+  filtered;
 
   // 6. Read team members

[Survived] ArrowFunction
src/tools/garp-discover.ts:110:17
   }
 
   // 5. Sort by name for consistent ordering
-  filtered.sort((a, b) => a.name.localeCompare(b.name));
+  filtered.sort(() => undefined);
 
   // 6. Read team members

[Killed] BlockStatement
src/tools/garp-discover.ts:123:55
 // ---------------------------------------------------------------------------
 
 /** Map SkillMetadata from skill-loader into a SkillCatalogEntry. */
-function toEntry(m: SkillMetadata): SkillCatalogEntry {
-  return {
-    name: m.name,
-    description: m.description,
-    when_to_use: m.when_to_use,
-    context_bundle: m.context_bundle,
-    response_bundle: m.response_bundle,
-    has_brain: m.has_brain,
-  };
-}
+function toEntry(m: SkillMetadata): SkillCatalogEntry {}
 
 /** Read team members from config, mapping to the required shape. */
killedBy: garp_discover: discover available request types and team lists all available skills with metadata when called with no query
statusReason: [Then] the result contains 4 skill entries sorted alphabetically by name -- Cannot read properties of undefined (reading 'name')

[Killed] BlockStatement
src/tools/garp-discover.ts:137:62
 /** Read team members from config, mapping to the required shape. */
 async function readTeam(
   ctx: GarpDiscoverContext,
-): Promise<Array<{ user_id: string; display_name: string }>> {
-  try {
-    const members = await ctx.config.readTeamMembers();
-    return members.map((m) => ({
-      user_id: m.user_id,
-      display_name: m.display_name,
-    }));
-  } catch (error) {
-    log("warn", "garp_discover: failed to read team members", {
-      error: error instanceof Error ? error.message : String(error),
-    });
-    return [];
-  }
-}
+): Promise<Array<{ user_id: string; display_name: string }>> {}
 
killedBy: garp_discover: discover available request types and team lists all available skills with metadata when called with no query
statusReason: [Then] the result includes team members -- expected false to be true // Object.is equality

[Killed] BlockStatement
src/tools/garp-discover.ts:138:7
 async function readTeam(
   ctx: GarpDiscoverContext,
 ): Promise<Array<{ user_id: string; display_name: string }>> {
-  try {
-    const members = await ctx.config.readTeamMembers();
-    return members.map((m) => ({
-      user_id: m.user_id,
-      display_name: m.display_name,
-    }));
-  } catch (error) {
+  try {} catch (error) {
     log("warn", "garp_discover: failed to read team members", {
       error: error instanceof Error ? error.message : String(error),
killedBy: garp_discover: discover available request types and team lists all available skills with metadata when called with no query
statusReason: [Then] the result includes team members -- expected false to be true // Object.is equality

[Killed] ArrowFunction
src/tools/garp-discover.ts:140:24
 ): Promise<Array<{ user_id: string; display_name: string }>> {
   try {
     const members = await ctx.config.readTeamMembers();
-    return members.map((m) => ({
-      user_id: m.user_id,
-      display_name: m.display_name,
-    }));
+    return members.map(() => undefined);
   } catch (error) {
     log("warn", "garp_discover: failed to read team members", {
killedBy: garp_discover: discover available request types and team lists all available skills with metadata when called with no query
statusReason: [Then] the result includes team members -- Cannot convert undefined or null to object

[Killed] ObjectLiteral
src/tools/garp-discover.ts:140:32
 ): Promise<Array<{ user_id: string; display_name: string }>> {
   try {
     const members = await ctx.config.readTeamMembers();
-    return members.map((m) => ({
-      user_id: m.user_id,
-      display_name: m.display_name,
-    }));
+    return members.map((m) => ({}));
   } catch (error) {
     log("warn", "garp_discover: failed to read team members", {
killedBy: garp_discover: discover available request types and team lists all available skills with metadata when called with no query
statusReason: [Then] the result includes team members -- expected {} to have property "user_id"

[NoCoverage] BlockStatement
src/tools/garp-discover.ts:144:19
       user_id: m.user_id,
       display_name: m.display_name,
     }));
-  } catch (error) {
-    log("warn", "garp_discover: failed to read team members", {
-      error: error instanceof Error ? error.message : String(error),
-    });
-    return [];
-  }
+  } catch (error) {}
 }
 

[NoCoverage] StringLiteral
src/tools/garp-discover.ts:145:17
       display_name: m.display_name,
     }));
   } catch (error) {
-    log("warn", "garp_discover: failed to read team members", {
+    log("warn", "", {
       error: error instanceof Error ? error.message : String(error),
     });

[NoCoverage] StringLiteral
src/tools/garp-discover.ts:145:9
       display_name: m.display_name,
     }));
   } catch (error) {
-    log("warn", "garp_discover: failed to read team members", {
+    log("", "garp_discover: failed to read team members", {
       error: error instanceof Error ? error.message : String(error),
     });
