[Killed] EqualityOperator
src/action-dispatcher.ts:48:7
 ): Promise<unknown> {
   const action = params.action;
 
-  if (action === undefined || action === null) {
+  if (action !== undefined || action === null) {
     throw new Error(
       "Missing required field: action. " +
killedBy: garp_do(inbox): check inbox for pending requests returns one pending request addressed to the current user
statusReason: [When] Bob checks his inbox -- Missing required field: action. Valid actions: send, respond, cancel, amend, check_status, inbox, view_thread

[Killed] LogicalOperator
src/action-dispatcher.ts:48:7
 ): Promise<unknown> {
   const action = params.action;
 
-  if (action === undefined || action === null) {
+  if (action === undefined && action === null) {
     throw new Error(
       "Missing required field: action. " +
killedBy: dispatchAction throws exact 'Missing required field: action' message for undefined action
statusReason: expected [Function] to throw error including 'Missing required field: action. Valid…' but got 'Invalid action: must be a non-empty s…'

[Killed] StringLiteral
src/action-dispatcher.ts:51:46
   if (action === undefined || action === null) {
     throw new Error(
       "Missing required field: action. " +
-        `Valid actions: ${VALID_ACTIONS.join(", ")}`,
+        `Valid actions: ${VALID_ACTIONS.join("")}`,
     );
   }
killedBy: dispatchAction throws exact 'Missing required field: action' message for undefined action
statusReason: expected [Function] to throw error including 'Missing required field: action. Valid…' but got 'Missing required field: action. Valid…'

[Killed] StringLiteral
src/action-dispatcher.ts:51:9
   if (action === undefined || action === null) {
     throw new Error(
       "Missing required field: action. " +
-        `Valid actions: ${VALID_ACTIONS.join(", ")}`,
+        ``,
     );
   }
killedBy: dispatchAction throws exact 'Missing required field: action' message for undefined action
statusReason: expected [Function] to throw error including 'Missing required field: action. Valid…' but got 'Missing required field: action. '

[Killed] ConditionalExpression
src/action-dispatcher.ts:55:7
     );
   }
 
-  if (typeof action !== "string" || action === "") {
+  if (true) {
     throw new Error(
       "Invalid action: must be a non-empty string. " +
killedBy: dispatchAction throws for unknown action 'deploy' listing valid actions
statusReason: expected [Function] to throw error matching /unknown action.*deploy/i but got 'Invalid action: must be a non-empty s…'

[Killed] LogicalOperator
src/action-dispatcher.ts:55:7
     );
   }
 
-  if (typeof action !== "string" || action === "") {
+  if (typeof action !== "string" && action === "") {
     throw new Error(
       "Invalid action: must be a non-empty string. " +
killedBy: dispatchAction throws exact 'Invalid action' message for empty string action
statusReason: expected [Function] to throw error including 'Invalid action: must be a non-empty s…' but got 'Unknown action \'\'. Valid actions: s…'

[Killed] StringLiteral
src/action-dispatcher.ts:57:7
 
   if (typeof action !== "string" || action === "") {
     throw new Error(
-      "Invalid action: must be a non-empty string. " +
+      "" +
         `Valid actions: ${VALID_ACTIONS.join(", ")}`,
     );
killedBy: dispatchAction throws exact 'Invalid action' message for empty string action
statusReason: expected [Function] to throw error including 'Invalid action: must be a non-empty s…' but got 'Valid actions: send, respond, cancel,…'

[Killed] StringLiteral
src/action-dispatcher.ts:58:9
   if (typeof action !== "string" || action === "") {
     throw new Error(
       "Invalid action: must be a non-empty string. " +
-        `Valid actions: ${VALID_ACTIONS.join(", ")}`,
+        ``,
     );
   }
killedBy: dispatchAction throws exact 'Invalid action' message for empty string action
statusReason: expected [Function] to throw error including 'Invalid action: must be a non-empty s…' but got 'Invalid action: must be a non-empty s…'

[Killed] BlockStatement
src/action-dispatcher.ts:63:17
   }
 
   const handler = ACTION_MAP[action];
-  if (!handler) {
-    throw new Error(
-      `Unknown action '${action}'. ` +
-        `Valid actions: ${VALID_ACTIONS.join(", ")}`,
-    );
-  }
+  if (!handler) {}
 
   return handler(params, ctx);
killedBy: dispatchAction throws for unknown action 'deploy' listing valid actions
statusReason: expected [Function] to throw error matching /unknown action.*deploy/i but got 'handler is not a function'

[Killed] BooleanLiteral
src/action-dispatcher.ts:63:7
   }
 
   const handler = ACTION_MAP[action];
-  if (!handler) {
+  if (handler) {
     throw new Error(
       `Unknown action '${action}'. ` +
killedBy: dispatchAction throws for unknown action 'deploy' listing valid actions
statusReason: expected [Function] to throw error matching /unknown action.*deploy/i but got 'handler is not a function'

[Killed] StringLiteral
src/action-dispatcher.ts:65:7
   const handler = ACTION_MAP[action];
   if (!handler) {
     throw new Error(
-      `Unknown action '${action}'. ` +
+      `` +
         `Valid actions: ${VALID_ACTIONS.join(", ")}`,
     );
killedBy: dispatchAction throws for unknown action 'deploy' listing valid actions
statusReason: expected [Function] to throw error matching /unknown action.*deploy/i but got 'Valid actions: send, respond, cancel,…'

[Killed] StringLiteral
src/action-dispatcher.ts:66:9
   if (!handler) {
     throw new Error(
       `Unknown action '${action}'. ` +
-        `Valid actions: ${VALID_ACTIONS.join(", ")}`,
+        ``,
     );
   }
killedBy: dispatchAction throws for unknown action 'deploy' listing valid actions
statusReason: expected [Function] to throw error matching /send/ but got 'Unknown action \'deploy\'. '
