[Killed] BlockStatement
src/tools/garp-do.ts:23:21
 export async function handleGarpDo(
   params: Record<string, unknown>,
   ctx: GarpDoContext,
-): Promise<unknown> {
-  return dispatchAction(params, ctx);
-}
+): Promise<unknown> {}
 
killedBy: inbox enrichment: skill description and response fields in inbox entries includes skill_description and response_fields in inbox entries for existing skills
statusReason: [Then] the inbox entry includes skill_description -- Cannot read properties of undefined (reading 'requests')
