[Killed] ConditionalExpression
src/tools/pact-request.ts:73:7
   params: PactRequestParams,
   ctx: PactRequestContext,
 ): Promise<SendResult | ComposeResult> {
-  if (!params.request_type) throw new Error("Missing required field: request_type");
+  if (false) throw new Error("Missing required field: request_type");
 
   // No context_bundle means the caller wants the pact schema, not a send
killedBy: pact_do(send): submit a PACT request rejects request missing required field: request_type
statusReason: [When] Alice submits a request without a request_type -- expected [Function] to throw error matching /missing required field.*request_type/i but got 'No pact found for request type \'unde…'

[Killed] ConditionalExpression
src/tools/pact-request.ts:73:7
   params: PactRequestParams,
   ctx: PactRequestContext,
 ): Promise<SendResult | ComposeResult> {
-  if (!params.request_type) throw new Error("Missing required field: request_type");
+  if (true) throw new Error("Missing required field: request_type");
 
   // No context_bundle means the caller wants the pact schema, not a send
killedBy: pact_do(send): submit a PACT request submits a sanity-check request with valid envelope and pushes to remote
statusReason: [When] Alice submits a sanity-check request to Bob -- Missing required field: request_type

[Killed] ConditionalExpression
src/tools/pact-request.ts:76:7
   if (!params.request_type) throw new Error("Missing required field: request_type");
 
   // No context_bundle means the caller wants the pact schema, not a send
-  if (!params.context_bundle) {
+  if (true) {
     return loadComposeResponse(ctx.file, params.request_type);
   }
killedBy: pact_do(send): submit a PACT request submits a sanity-check request with valid envelope and pushes to remote
statusReason: [When] Alice submits a sanity-check request to Bob -- expected undefined to be 'Request submitted' // Object.is equality

[Killed] BlockStatement
src/tools/pact-request.ts:76:31
   if (!params.request_type) throw new Error("Missing required field: request_type");
 
   // No context_bundle means the caller wants the pact schema, not a send
-  if (!params.context_bundle) {
-    return loadComposeResponse(ctx.file, params.request_type);
-  }
+  if (!params.context_bundle) {}
 
   // Resolve recipient list: new recipients[] or legacy singular recipient
killedBy: pact_do(send): submit a PACT request returns compose-mode response with pact schema when context_bundle omitted
statusReason: [When] Alice sends with request_type but no context_bundle -- Missing required field: recipient or recipients

[Killed] ConditionalExpression
src/tools/pact-request.ts:81:33
   }
 
   // Resolve recipient list: new recipients[] or legacy singular recipient
-  const hasExplicitRecipients = (params.recipients?.length ?? 0) > 0;
+  const hasExplicitRecipients = true;
   let recipientIds: string[];
   if (hasExplicitRecipients) {
killedBy: pact_do(send): submit a PACT request submits a sanity-check request with valid envelope and pushes to remote
statusReason: [When] Alice submits a sanity-check request to Bob -- Cannot read properties of undefined (reading 'map')

[Killed] EqualityOperator
src/tools/pact-request.ts:81:33
   }
 
   // Resolve recipient list: new recipients[] or legacy singular recipient
-  const hasExplicitRecipients = (params.recipients?.length ?? 0) > 0;
+  const hasExplicitRecipients = (params.recipients?.length ?? 0) >= 0;
   let recipientIds: string[];
   if (hasExplicitRecipients) {
killedBy: Mutation hardening: pact-thread.ts view_thread with single response returns top-level response (not responses array)
statusReason: [Given] Alice sends a single-recipient request and Bob responds -- Cannot read properties of undefined (reading 'map')

[Killed] BlockStatement
src/tools/pact-request.ts:83:30
   // Resolve recipient list: new recipients[] or legacy singular recipient
   const hasExplicitRecipients = (params.recipients?.length ?? 0) > 0;
   let recipientIds: string[];
-  if (hasExplicitRecipients) {
-    recipientIds = params.recipients!.map(normalizeId);
-  } else if (params.recipient) {
+  if (hasExplicitRecipients) {} else if (params.recipient) {
     recipientIds = [normalizeId(params.recipient)];
   } else {
killedBy: Mutation hardening: response-loader.ts check_status on pending request returns status without response (tolerateMissing=default)
statusReason: [Given] Alice sends a request to Bob (no one has responded yet) -- Cannot read properties of undefined (reading 'length')

[Killed] ConditionalExpression
src/tools/pact-request.ts:83:7
   // Resolve recipient list: new recipients[] or legacy singular recipient
   const hasExplicitRecipients = (params.recipients?.length ?? 0) > 0;
   let recipientIds: string[];
-  if (hasExplicitRecipients) {
+  if (false) {
     recipientIds = params.recipients!.map(normalizeId);
   } else if (params.recipient) {
killedBy: Mutation hardening: response-loader.ts check_status on pending request returns status without response (tolerateMissing=default)
statusReason: [Given] Alice sends a request to Bob (no one has responded yet) -- Missing required field: recipient or recipients

[Killed] ConditionalExpression
src/tools/pact-request.ts:85:14
   let recipientIds: string[];
   if (hasExplicitRecipients) {
     recipientIds = params.recipients!.map(normalizeId);
-  } else if (params.recipient) {
+  } else if (true) {
     recipientIds = [normalizeId(params.recipient)];
   } else {
killedBy: pact_do(send): submit a PACT request rejects request missing required field: recipient
statusReason: [When] Alice submits a request without a recipient -- expected [Function] to throw error matching /missing required field.*recipient/i but got 'Cannot read properties of undefined (…'

[Killed] BlockStatement
src/tools/pact-request.ts:85:32
   let recipientIds: string[];
   if (hasExplicitRecipients) {
     recipientIds = params.recipients!.map(normalizeId);
-  } else if (params.recipient) {
-    recipientIds = [normalizeId(params.recipient)];
-  } else {
+  } else if (params.recipient) {} else {
     throw new Error("Missing required field: recipient or recipients");
   }
killedBy: Mutation hardening: pact-thread.ts view_thread with single response returns top-level response (not responses array)
statusReason: [Given] Alice sends a single-recipient request and Bob responds -- Cannot read properties of undefined (reading 'length')

[Killed] BlockStatement
src/tools/pact-request.ts:87:10
     recipientIds = params.recipients!.map(normalizeId);
   } else if (params.recipient) {
     recipientIds = [normalizeId(params.recipient)];
-  } else {
-    throw new Error("Missing required field: recipient or recipients");
-  }
+  } else {}
 
   if (recipientIds.length === 0) {
killedBy: pact_do: perform actions through collapsed tool surface passes through missing required field error from handler unchanged
statusReason: [When] Alice sends via pact_do without a recipient -- expected [Function] to throw error matching /missing required field.*recipient/i but got 'Cannot read properties of undefined (…'

[Killed] EqualityOperator
src/tools/pact-request.ts:91:7
     throw new Error("Missing required field: recipient or recipients");
   }
 
-  if (recipientIds.length === 0) {
+  if (recipientIds.length !== 0) {
     throw new Error("Recipients list must not be empty");
   }
killedBy: pact_do(send): submit a PACT request submits a sanity-check request with valid envelope and pushes to remote
statusReason: [When] Alice submits a sanity-check request to Bob -- Recipients list must not be empty

[Killed] ConditionalExpression
src/tools/pact-request.ts:91:7
     throw new Error("Missing required field: recipient or recipients");
   }
 
-  if (recipientIds.length === 0) {
+  if (true) {
     throw new Error("Recipients list must not be empty");
   }
killedBy: Mutation hardening: response-loader.ts check_status on pending request returns status without response (tolerateMissing=default)
statusReason: [Given] Alice sends a request to Bob (no one has responded yet) -- Recipients list must not be empty

[Killed] ConditionalExpression
src/tools/pact-request.ts:95:7
     throw new Error("Recipients list must not be empty");
   }
 
-  if (recipientIds.includes(ctx.userId)) {
+  if (true) {
     throw new Error("Sender cannot be a recipient");
   }
killedBy: pact_do(send): submit a PACT request submits a sanity-check request with valid envelope and pushes to remote
statusReason: [When] Alice submits a sanity-check request to Bob -- Sender cannot be a recipient

[Killed] BlockStatement
src/tools/pact-request.ts:95:42
     throw new Error("Recipients list must not be empty");
   }
 
-  if (recipientIds.includes(ctx.userId)) {
-    throw new Error("Sender cannot be a recipient");
-  }
+  if (recipientIds.includes(ctx.userId)) {}
 
   // Pact must exist in either flat-file store or legacy directory
killedBy: Group addressing error paths and backward compat (pact-y30) rejects send when sender is in recipients array
statusReason: [Then] send fails because sender cannot be a recipient -- expected undefined to be defined

[Survived] StringLiteral
src/tools/pact-request.ts:96:21
   }
 
   if (recipientIds.includes(ctx.userId)) {
-    throw new Error("Sender cannot be a recipient");
+    throw new Error("");
   }
 

[Killed] BlockStatement
src/tools/pact-request.ts:102:41
   // Pact must exist in either flat-file store or legacy directory
   const flatFileExists = await ctx.file.fileExists(`pact-store/${params.request_type}.md`);
   const legacyExists = await ctx.file.fileExists(`pacts/${params.request_type}/PACT.md`);
-  if (!flatFileExists && !legacyExists) {
-    throw new Error(`No pact found for request type '${params.request_type}'`);
-  }
+  if (!flatFileExists && !legacyExists) {}
 
   // Warn (don't reject) when required context fields are missing
killedBy: pact_do(send): submit a PACT request rejects request when request_type has no matching pact directory
statusReason: [When] Alice submits a request with type 'code-review' (no pact file) -- promise resolved "{ …(5) }" instead of rejecting

[Killed] BooleanLiteral
src/tools/pact-request.ts:102:7
   // Pact must exist in either flat-file store or legacy directory
   const flatFileExists = await ctx.file.fileExists(`pact-store/${params.request_type}.md`);
   const legacyExists = await ctx.file.fileExists(`pacts/${params.request_type}/PACT.md`);
-  if (!flatFileExists && !legacyExists) {
+  if (flatFileExists && !legacyExists) {
     throw new Error(`No pact found for request type '${params.request_type}'`);
   }
killedBy: pact_do(send): submit a PACT request submits a sanity-check request with valid envelope and pushes to remote
statusReason: [When] Alice submits a sanity-check request to Bob -- No pact found for request type 'sanity-check'

[Killed] BlockStatement
src/tools/pact-request.ts:109:23
   // Warn (don't reject) when required context fields are missing
   let validationWarnings: string[] | undefined;
   const requiredFields = await getRequiredContextFieldsFromYaml(ctx.file, params.request_type);
-  if (requiredFields) {
-    const submittedKeys = Object.keys(params.context_bundle);
-    const missing = requiredFields.filter((field) => !submittedKeys.includes(field));
-    if (missing.length > 0) {
-      validationWarnings = missing.map((field) => `Missing required field '${field}'`);
-    }
-  }
+  if (requiredFields) {}
 
   const recipientRefs = recipientIds.map((id) => ({ user_id: id }));
killedBy: schema.json: typed pacts and validation warnings warns on missing required fields and still submits the request successfully
statusReason: [Then] the response includes validation_warnings mentioning missing fields -- expected +0 to be 2 // Object.is equality

[Killed] ConditionalExpression
src/tools/pact-request.ts:109:7
   // Warn (don't reject) when required context fields are missing
   let validationWarnings: string[] | undefined;
   const requiredFields = await getRequiredContextFieldsFromYaml(ctx.file, params.request_type);
-  if (requiredFields) {
+  if (true) {
     const submittedKeys = Object.keys(params.context_bundle);
     const missing = requiredFields.filter((field) => !submittedKeys.includes(field));
killedBy: pact: pact validation and auto-loading pact file without YAML frontmatter still allows sending (dumb pipe)
statusReason: [When] Alice submits an 'empty-pact' request -- Cannot read properties of undefined (reading 'filter')

[Killed] MethodExpression
src/tools/pact-request.ts:111:21
   const requiredFields = await getRequiredContextFieldsFromYaml(ctx.file, params.request_type);
   if (requiredFields) {
     const submittedKeys = Object.keys(params.context_bundle);
-    const missing = requiredFields.filter((field) => !submittedKeys.includes(field));
+    const missing = requiredFields;
     if (missing.length > 0) {
       validationWarnings = missing.map((field) => `Missing required field '${field}'`);
killedBy: schema.json: typed pacts and validation warnings warns on missing required fields and still submits the request successfully
statusReason: [Then] the response includes validation_warnings mentioning missing fields -- expected 6 to be 2 // Object.is equality

[Killed] ArrowFunction
src/tools/pact-request.ts:111:43
   const requiredFields = await getRequiredContextFieldsFromYaml(ctx.file, params.request_type);
   if (requiredFields) {
     const submittedKeys = Object.keys(params.context_bundle);
-    const missing = requiredFields.filter((field) => !submittedKeys.includes(field));
+    const missing = requiredFields.filter(() => undefined);
     if (missing.length > 0) {
       validationWarnings = missing.map((field) => `Missing required field '${field}'`);
killedBy: schema.json: typed pacts and validation warnings warns on missing required fields and still submits the request successfully
statusReason: [Then] the response includes validation_warnings mentioning missing fields -- expected +0 to be 2 // Object.is equality

[Killed] ConditionalExpression
src/tools/pact-request.ts:112:9
   if (requiredFields) {
     const submittedKeys = Object.keys(params.context_bundle);
     const missing = requiredFields.filter((field) => !submittedKeys.includes(field));
-    if (missing.length > 0) {
+    if (false) {
       validationWarnings = missing.map((field) => `Missing required field '${field}'`);
     }
killedBy: schema.json: typed pacts and validation warnings warns on missing required fields and still submits the request successfully
statusReason: [Then] the response includes validation_warnings mentioning missing fields -- expected +0 to be 2 // Object.is equality

[Killed] EqualityOperator
src/tools/pact-request.ts:112:9
   if (requiredFields) {
     const submittedKeys = Object.keys(params.context_bundle);
     const missing = requiredFields.filter((field) => !submittedKeys.includes(field));
-    if (missing.length > 0) {
+    if (missing.length <= 0) {
       validationWarnings = missing.map((field) => `Missing required field '${field}'`);
     }
killedBy: schema.json: typed pacts and validation warnings warns on missing required fields and still submits the request successfully
statusReason: [Then] the response includes validation_warnings mentioning missing fields -- expected +0 to be 2 // Object.is equality

[Killed] ArrowFunction
src/tools/pact-request.ts:113:40
     const submittedKeys = Object.keys(params.context_bundle);
     const missing = requiredFields.filter((field) => !submittedKeys.includes(field));
     if (missing.length > 0) {
-      validationWarnings = missing.map((field) => `Missing required field '${field}'`);
+      validationWarnings = missing.map(() => undefined);
     }
   }
killedBy: schema.json: typed pacts and validation warnings warns on missing required fields and still submits the request successfully
statusReason: [Then] the response includes validation_warnings mentioning missing fields -- expected ' ' to match /customer/i

[Killed] StringLiteral
src/tools/pact-request.ts:113:51
     const submittedKeys = Object.keys(params.context_bundle);
     const missing = requiredFields.filter((field) => !submittedKeys.includes(field));
     if (missing.length > 0) {
-      validationWarnings = missing.map((field) => `Missing required field '${field}'`);
+      validationWarnings = missing.map((field) => ``);
     }
   }
killedBy: schema.json: typed pacts and validation warnings warns on missing required fields and still submits the request successfully
statusReason: [Then] the response includes validation_warnings mentioning missing fields -- expected ' ' to match /customer/i

[Killed] ArrowFunction
src/tools/pact-request.ts:117:42
     }
   }
 
-  const recipientRefs = recipientIds.map((id) => ({ user_id: id }));
+  const recipientRefs = recipientIds.map(() => undefined);
 
   const userConfig = await ctx.config.readUserConfig();
killedBy: schema.json: typed pacts and validation warnings existing workflows work identically when schema.json is not present
statusReason: [Then] the request envelope has the standard structure -- Cannot read properties of undefined (reading 'user_id')

[Killed] OptionalChaining
src/tools/pact-request.ts:123:26
   const sender = { user_id: userConfig.user_id, display_name: userConfig.display_name };
 
   const requestId = generateRequestId(ctx.userId);
-  const attachmentMeta = params.attachments?.map(({ filename, description }) => ({ filename, description }));
+  const attachmentMeta = params.attachments.map(({ filename, description }) => ({ filename, description }));
   const threadId = params.thread_id ?? requestId;
   const envelope: Record<string, unknown> = {
killedBy: schema.json: typed pacts and validation warnings warns on missing required fields and still submits the request successfully
statusReason: [When] Alice submits a sanity-check request missing 'customer' and 'product' -- Cannot read properties of undefined (reading 'map')

[Killed] ArrowFunction
src/tools/pact-request.ts:123:50
   const sender = { user_id: userConfig.user_id, display_name: userConfig.display_name };
 
   const requestId = generateRequestId(ctx.userId);
-  const attachmentMeta = params.attachments?.map(({ filename, description }) => ({ filename, description }));
+  const attachmentMeta = params.attachments?.map(() => undefined);
   const threadId = params.thread_id ?? requestId;
   const envelope: Record<string, unknown> = {
killedBy: pact_do(send): submit a PACT request submits a request with file attachments written to disk and metadata in envelope
statusReason: [Then] envelope contains attachment metadata without file content -- expected null to deeply equal { filename: 'crash.log', …(1) }

[Killed] LogicalOperator
src/tools/pact-request.ts:124:20
 
   const requestId = generateRequestId(ctx.userId);
   const attachmentMeta = params.attachments?.map(({ filename, description }) => ({ filename, description }));
-  const threadId = params.thread_id ?? requestId;
+  const threadId = params.thread_id && requestId;
   const envelope: Record<string, unknown> = {
     request_id: requestId,
killedBy: pact_do(send): submit a PACT request preserves explicit thread_id in envelope and return value when provided
statusReason: [Then] the envelope contains thread_id matching the provided value -- expected 'req-20260225-201901-alice-ba9c' to be 'req-20260220-100000-alice-0001' // Object.is equality

[Killed] ObjectLiteral
src/tools/pact-request.ts:125:45
   const requestId = generateRequestId(ctx.userId);
   const attachmentMeta = params.attachments?.map(({ filename, description }) => ({ filename, description }));
   const threadId = params.thread_id ?? requestId;
-  const envelope: Record<string, unknown> = {
-    request_id: requestId,
-    thread_id: threadId,
-    request_type: params.request_type,
-    sender,
-    recipient: recipientRefs[0], // backward compat: first recipient for old readers
-    ...(hasExplicitRecipients ? { recipients: recipientRefs } : {}),
-    status: "pending",
-    created_at: new Date().toISOString(),
-    deadline: params.deadline ?? null,
-    context_bundle: params.context_bundle,
-    expected_response: { type: "text" },
-    ...(attachmentMeta?.length ? { attachments: attachmentMeta } : {}),
-  };
+  const envelope: Record<string, unknown> = {};
 
   if (params.group_ref) {
killedBy: schema.json: typed pacts and validation warnings warns on missing required fields and still submits the request successfully
statusReason: [Then] the request file exists on disk with the submitted bundle -- Cannot read properties of undefined (reading 'issue_summary')

[Killed] LogicalOperator
src/tools/pact-request.ts:134:15
     ...(hasExplicitRecipients ? { recipients: recipientRefs } : {}),
     status: "pending",
     created_at: new Date().toISOString(),
-    deadline: params.deadline ?? null,
+    deadline: params.deadline && null,
     context_bundle: params.context_bundle,
     expected_response: { type: "text" },
killedBy: pact_do(send): submit a PACT request includes optional deadline field when provided
statusReason: [When] Alice submits a request with a deadline -- expected null to be '2026-02-21T18:00:00Z' // Object.is equality

[Killed] StringLiteral
src/tools/pact-request.ts:136:32
     created_at: new Date().toISOString(),
     deadline: params.deadline ?? null,
     context_bundle: params.context_bundle,
-    expected_response: { type: "text" },
+    expected_response: { type: "" },
     ...(attachmentMeta?.length ? { attachments: attachmentMeta } : {}),
   };
killedBy: pact_do(send): submit a PACT request submits a sanity-check request with valid envelope and pushes to remote
statusReason: [Then] a request file is created in pending with correct envelope -- expected { …(10) } to match object { …(7) }
(3 matching properties omitted from actual)

[Killed] OptionalChaining
src/tools/pact-request.ts:137:9
     deadline: params.deadline ?? null,
     context_bundle: params.context_bundle,
     expected_response: { type: "text" },
-    ...(attachmentMeta?.length ? { attachments: attachmentMeta } : {}),
+    ...(attachmentMeta.length ? { attachments: attachmentMeta } : {}),
   };
 
killedBy: pact_do(send): submit a PACT request submits a sanity-check request with valid envelope and pushes to remote
statusReason: [When] Alice submits a sanity-check request to Bob -- Cannot read properties of undefined (reading 'length')

[Killed] ObjectLiteral
src/tools/pact-request.ts:137:34
     deadline: params.deadline ?? null,
     context_bundle: params.context_bundle,
     expected_response: { type: "text" },
-    ...(attachmentMeta?.length ? { attachments: attachmentMeta } : {}),
+    ...(attachmentMeta?.length ? {} : {}),
   };
 
killedBy: pact_do(send): submit a PACT request submits a request with file attachments written to disk and metadata in envelope
statusReason: [Then] envelope contains attachment metadata without file content -- Target cannot be null or undefined.

[Killed] ConditionalExpression
src/tools/pact-request.ts:140:7
     ...(attachmentMeta?.length ? { attachments: attachmentMeta } : {}),
   };
 
-  if (params.group_ref) {
+  if (false) {
     envelope.group_ref = params.group_ref;
   }
killedBy: Mutation hardening: pact-thread.ts view_thread with single response returns top-level response (not responses array)
statusReason: Test timed out in 30000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] BlockStatement
src/tools/pact-request.ts:140:25
     ...(attachmentMeta?.length ? { attachments: attachmentMeta } : {}),
   };
 
-  if (params.group_ref) {
-    envelope.group_ref = params.group_ref;
-  }
+  if (params.group_ref) {}
 
   const filesToAdd = [`requests/pending/${requestId}.json`];
killedBy: Walking Skeleton: group request round-trip (pact-y30) inbox entries for group requests include recipient count and group reference
statusReason: [Then] Bob's inbox shows recipient count and group reference -- expected undefined to be '@backend-team' // Object.is equality

[Killed] StringLiteral
src/tools/pact-request.ts:144:23
     envelope.group_ref = params.group_ref;
   }
 
-  const filesToAdd = [`requests/pending/${requestId}.json`];
+  const filesToAdd = [``];
   if (params.attachments?.length) {
     for (const attachment of params.attachments) {
killedBy: Mutation hardening: response-loader.ts check_status on pending request returns status without response (tolerateMissing=default)
statusReason: [Given] Alice sends a request to Bob (no one has responded yet) -- fatal: empty string is not a valid pathspec. please use . instead if you meant to match all paths

[Killed] BlockStatement
src/tools/pact-request.ts:145:35
   }
 
   const filesToAdd = [`requests/pending/${requestId}.json`];
-  if (params.attachments?.length) {
-    for (const attachment of params.attachments) {
-      const attachmentPath = `attachments/${requestId}/${attachment.filename}`;
-      await ctx.file.writeText(attachmentPath, attachment.content);
-      filesToAdd.push(attachmentPath);
-    }
-  }
+  if (params.attachments?.length) {}
 
   const recipientLabel = recipientIds.length === 1
killedBy: pact_do(send): submit a PACT request submits a request with file attachments written to disk and metadata in envelope
statusReason: [Then] attachment files exist on disk -- expected false to be true // Object.is equality

[Killed] OptionalChaining
src/tools/pact-request.ts:145:7
   }
 
   const filesToAdd = [`requests/pending/${requestId}.json`];
-  if (params.attachments?.length) {
+  if (params.attachments.length) {
     for (const attachment of params.attachments) {
       const attachmentPath = `attachments/${requestId}/${attachment.filename}`;
killedBy: Mutation hardening: response-loader.ts check_status on pending request returns status without response (tolerateMissing=default)
statusReason: [Given] Alice sends a request to Bob (no one has responded yet) -- Cannot read properties of undefined (reading 'length')

[Killed] BlockStatement
src/tools/pact-request.ts:146:50
 
   const filesToAdd = [`requests/pending/${requestId}.json`];
   if (params.attachments?.length) {
-    for (const attachment of params.attachments) {
-      const attachmentPath = `attachments/${requestId}/${attachment.filename}`;
-      await ctx.file.writeText(attachmentPath, attachment.content);
-      filesToAdd.push(attachmentPath);
-    }
+    for (const attachment of params.attachments) {}
   }
 
killedBy: pact_do(send): submit a PACT request submits a request with file attachments written to disk and metadata in envelope
statusReason: [Then] attachment files exist on disk -- expected false to be true // Object.is equality

[Killed] StringLiteral
src/tools/pact-request.ts:147:30
   const filesToAdd = [`requests/pending/${requestId}.json`];
   if (params.attachments?.length) {
     for (const attachment of params.attachments) {
-      const attachmentPath = `attachments/${requestId}/${attachment.filename}`;
+      const attachmentPath = ``;
       await ctx.file.writeText(attachmentPath, attachment.content);
       filesToAdd.push(attachmentPath);
killedBy: pact_do(send): submit a PACT request submits a request with file attachments written to disk and metadata in envelope
statusReason: [When] Alice submits a request with two attachments -- EISDIR: illegal operation on a directory, open '/var/folders/3j/t9wfhf615y903ky6m76j7sx80000gn/T/pact-accept-75NHoz/alice'

[Killed] ConditionalExpression
src/tools/pact-request.ts:153:26
     }
   }
 
-  const recipientLabel = recipientIds.length === 1
+  const recipientLabel = false
     ? recipientIds[0]
     : `[${recipientIds.join(",")}]`;
killedBy: pact_do(send): submit a PACT request submits a sanity-check request with valid envelope and pushes to remote
statusReason: [Then] the file is committed with a structured message and pushed -- expected '[pact] new request: req-20260225-2020…' to match /\[pact\] new request:.*sanity-check.*…/

[Killed] EqualityOperator
src/tools/pact-request.ts:153:26
     }
   }
 
-  const recipientLabel = recipientIds.length === 1
+  const recipientLabel = recipientIds.length !== 1
     ? recipientIds[0]
     : `[${recipientIds.join(",")}]`;
killedBy: pact_do(send): submit a PACT request submits a sanity-check request with valid envelope and pushes to remote
statusReason: [Then] the file is committed with a structured message and pushed -- expected '[pact] new request: req-20260225-2020…' to match /\[pact\] new request:.*sanity-check.*…/

[Killed] StringLiteral
src/tools/pact-request.ts:159:5
   await ctx.file.writeJSON(`requests/pending/${requestId}.json`, envelope);
   await ctx.git.add(filesToAdd);
   await ctx.git.commit(
-    `[pact] new request: ${requestId} (${params.request_type}) -> ${recipientLabel}`,
+    ``,
   );
   await ctx.git.push();
killedBy: Mutation hardening: response-loader.ts check_status on pending request returns status without response (tolerateMissing=default)
statusReason: [Given] Alice sends a request to Bob (no one has responded yet) -- Aborting commit due to empty commit message.

[Killed] StringLiteral
src/tools/pact-request.ts:167:14
     request_id: requestId,
     thread_id: threadId,
     status: "pending",
-    message: "Request submitted",
+    message: "",
     validation_warnings: validationWarnings ?? [],
   };
killedBy: pact_do(send): submit a PACT request submits a sanity-check request with valid envelope and pushes to remote
statusReason: [When] Alice submits a sanity-check request to Bob -- expected '' to be 'Request submitted' // Object.is equality
