[Killed] LogicalOperator
src/tools/pact-request.ts:168:26
     thread_id: threadId,
     status: "pending",
     message: "Request submitted",
-    validation_warnings: validationWarnings ?? [],
+    validation_warnings: validationWarnings && [],
   };
 }
killedBy: schema.json: typed pacts and validation warnings warns on missing required fields and still submits the request successfully
statusReason: [Then] the response includes validation_warnings mentioning missing fields -- expected +0 to be 2 // Object.is equality

[Killed] ConditionalExpression
src/tools/pact-request.ts:190:7
   let pact: PactMetadata | undefined = await loadFlatFilePactByName(file, requestType);
 
   // Fall back to legacy directory format
-  if (!pact) {
+  if (true) {
     pact = await loadPactMetadata(file, requestType);
   }
killedBy: pact_do(send): submit a PACT request returns compose-mode response with pact schema when context_bundle omitted
statusReason: [When] Alice sends with request_type but no context_bundle -- No pact found for request type 'sanity-check'

[Killed] BooleanLiteral
src/tools/pact-request.ts:190:7
   let pact: PactMetadata | undefined = await loadFlatFilePactByName(file, requestType);
 
   // Fall back to legacy directory format
-  if (!pact) {
+  if (pact) {
     pact = await loadPactMetadata(file, requestType);
   }
killedBy: pact_do(send): submit a PACT request returns compose-mode response with pact schema when context_bundle omitted
statusReason: [When] Alice sends with request_type but no context_bundle -- No pact found for request type 'sanity-check'

[Killed] ConditionalExpression
src/tools/pact-request.ts:194:7
     pact = await loadPactMetadata(file, requestType);
   }
 
-  if (!pact) {
+  if (false) {
     throw new Error(`No pact found for request type '${requestType}'`);
   }
killedBy: pact_do(send): submit a PACT request throws pact-not-found when compose mode gets unknown request_type
statusReason: [When] Alice sends with an unknown request_type and no context_bundle -- expected [Function] to throw error matching /no pact found.*nonexistent-pact/i but got 'Cannot read properties of undefined (…'

[Killed] BlockStatement
src/tools/pact-request.ts:194:14
     pact = await loadPactMetadata(file, requestType);
   }
 
-  if (!pact) {
-    throw new Error(`No pact found for request type '${requestType}'`);
-  }
+  if (!pact) {}
 
   return {
killedBy: pact_do(send): submit a PACT request throws pact-not-found when compose mode gets unknown request_type
statusReason: [When] Alice sends with an unknown request_type and no context_bundle -- expected [Function] to throw error matching /no pact found.*nonexistent-pact/i but got 'Cannot read properties of undefined (…'

[Killed] StringLiteral
src/tools/pact-request.ts:199:11
   }
 
   return {
-    mode: "compose",
+    mode: "",
     request_type: pact.name,
     description: pact.description,
killedBy: pact_do(send): submit a PACT request returns compose-mode response with pact schema when context_bundle omitted
statusReason: [When] Alice sends with request_type but no context_bundle -- expected '' to be 'compose' // Object.is equality

[NoCoverage] ObjectLiteral
src/tools/pact-request.ts:207:25
     response_bundle: pact.response_bundle,
     has_hooks: pact.has_hooks,
     ...(pact.scope ? { scope: pact.scope } : {}),
-    ...(pact.defaults ? { defaults: pact.defaults } : {}),
+    ...(pact.defaults ? {} : {}),
     ...(pact.multi_round !== undefined ? { multi_round: pact.multi_round } : {}),
     ...(pact.attachments ? { attachments: pact.attachments } : {}),

[Survived] EqualityOperator
src/tools/pact-request.ts:208:9
     has_hooks: pact.has_hooks,
     ...(pact.scope ? { scope: pact.scope } : {}),
     ...(pact.defaults ? { defaults: pact.defaults } : {}),
-    ...(pact.multi_round !== undefined ? { multi_round: pact.multi_round } : {}),
+    ...(pact.multi_round === undefined ? { multi_round: pact.multi_round } : {}),
     ...(pact.attachments ? { attachments: pact.attachments } : {}),
   };

[Survived] ConditionalExpression
src/tools/pact-request.ts:208:9
     has_hooks: pact.has_hooks,
     ...(pact.scope ? { scope: pact.scope } : {}),
     ...(pact.defaults ? { defaults: pact.defaults } : {}),
-    ...(pact.multi_round !== undefined ? { multi_round: pact.multi_round } : {}),
+    ...(false ? { multi_round: pact.multi_round } : {}),
     ...(pact.attachments ? { attachments: pact.attachments } : {}),
   };

[NoCoverage] ObjectLiteral
src/tools/pact-request.ts:209:28
     ...(pact.scope ? { scope: pact.scope } : {}),
     ...(pact.defaults ? { defaults: pact.defaults } : {}),
     ...(pact.multi_round !== undefined ? { multi_round: pact.multi_round } : {}),
-    ...(pact.attachments ? { attachments: pact.attachments } : {}),
+    ...(pact.attachments ? {} : {}),
   };
 }
